sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
/* MemMap defeat for faster Polyspace analysis */
#ifndef DEFEAT_MEMMAP

/**********************************************************************************************************************
*  GLOBAL CONSTANT MACROS
**********************************************************************************************************************/

#undef MEM_VENDOR_ID
#undef MEM_AR_MAJOR_VERSION
#undef MEM_AR_MINOR_VERSION
#undef MEM_AR_PATCH_VERSION
#undef MEM_SW_MAJOR_VERSION
#undef MEM_SW_MINOR_VERSION
#undef MEM_SW_PATCH_VERSION

#define MEM_VENDOR_ID        (30u)
#define MEM_AR_MAJOR_VERSION (1u)                      /* part of Autosare release 3.0.1 */
#define MEM_AR_MINOR_VERSION (1u)
#define MEM_AR_PATCH_VERSION (0u)

#define MEM_SW_MAJOR_VERSION (1u)
#define MEM_SW_MINOR_VERSION (5u)
#define MEM_SW_PATCH_VERSION (4u)

#define MEMMAP_ERROR

/* Package Merger: Start Section MemMapModuleList */

/* Include these prior to Rte_MemMap, because that file includes Os_MemMap */

#include "Wdg_MemMap.h"
#include "WdgM_MemMap.h"

/* include Rte MemMap because the Rte sections are configuration dependent*/
#include "Rte_MemMap.h"


/**********************************************************************************************************************
*  AbsHwPos START
**********************************************************************************************************************/

#ifdef ABSHWPOS_START_SEC_VAR_CLEARED_32
	#undef ABSHWPOS_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef ABSHWPOS_STOP_SEC_VAR_CLEARED_32
	#undef ABSHWPOS_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef ABSHWPOS_START_SEC_VAR_CLEARED_16
	#undef ABSHWPOS_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef ABSHWPOS_STOP_SEC_VAR_CLEARED_16
	#undef ABSHWPOS_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef ABSHWPOS_START_SEC_VAR_CLEARED_8
	#undef ABSHWPOS_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef ABSHWPOS_STOP_SEC_VAR_CLEARED_8
	#undef ABSHWPOS_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef ABSHWPOS_START_SEC_VAR_CLEARED_BOOLEAN
	#undef ABSHWPOS_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef ABSHWPOS_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef ABSHWPOS_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef ABSHWPOS_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef ABSHWPOS_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef ABSHWPOS_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef ABSHWPOS_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  AbsHwPos END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  ActivePull START
**********************************************************************************************************************/

#ifdef ACTIVEPULL_START_SEC_VAR_SAVED_ZONEH_32
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_9:noinit:typeH:ActivePull")
	#undef ACTIVEPULL_START_SEC_VAR_SAVED_ZONEH_32
	#undef MEMMAP_ERROR
#endif
#ifdef ACTIVEPULL_STOP_SEC_VAR_SAVED_ZONEH_32
	#undef ACTIVEPULL_STOP_SEC_VAR_SAVED_ZONEH_32
	#define STOP_SEC_VAR
#endif

#ifdef ACTIVEPULL_START_SEC_VAR_CLEARED_32
	#undef ACTIVEPULL_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef ACTIVEPULL_STOP_SEC_VAR_CLEARED_32
	#undef ACTIVEPULL_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef ACTIVEPULL_START_SEC_VAR_CLEARED_16
	#undef ACTIVEPULL_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef ACTIVEPULL_STOP_SEC_VAR_CLEARED_16
	#undef ACTIVEPULL_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef ACTIVEPULL_START_SEC_VAR_CLEARED_BOOLEAN
	#undef ACTIVEPULL_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef ACTIVEPULL_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef ACTIVEPULL_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef ACTIVEPULL_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef ACTIVEPULL_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef ACTIVEPULL_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef ACTIVEPULL_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  ActivePull END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Adc START
**********************************************************************************************************************/

#ifdef ADC_START_SEC_CODE
	#undef ADC_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef ADC_STOP_SEC_CODE
	#undef ADC_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef ADC2_START_SEC_CODE
	#undef ADC2_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef ADC2_STOP_SEC_CODE
	#undef ADC2_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef ADC_START_SEC_CONST_32
	#undef ADC_START_SEC_CONST_32
	#define START_SEC_CONST_32BIT
#endif
#ifdef ADC_STOP_SEC_CONST_32
	#undef ADC_STOP_SEC_CONST_32
	#define STOP_SEC_CONST
#endif

#ifdef ADC2_START_SEC_CONST_32
	#undef ADC2_START_SEC_CONST_32
	#define START_SEC_CONST_32BIT
#endif
#ifdef ADC2_STOP_SEC_CONST_32
	#undef ADC2_STOP_SEC_CONST_32
	#define STOP_SEC_CONST
#endif

/**********************************************************************************************************************
*  Adc END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  AppDesc START
**********************************************************************************************************************/

#ifdef APPDESC_START_SEC_VAR_CLEARED_32
	#undef APPDESC_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_6
#endif
#ifdef APPDESC_STOP_SEC_VAR_CLEARED_32
	#undef APPDESC_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

