sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef APPDESC_START_SEC_VAR_CLEARED_16
	#undef APPDESC_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_6
#endif
#ifdef APPDESC_STOP_SEC_VAR_CLEARED_16
	#undef APPDESC_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef APPDESC_START_SEC_VAR_CLEARED_8
	#undef APPDESC_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_6
#endif
#ifdef APPDESC_STOP_SEC_VAR_CLEARED_8
	#undef APPDESC_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef APPDESC_START_SEC_VAR_CLEARED_BOOLEAN
	#undef APPDESC_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef APPDESC_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef APPDESC_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  AppDesc END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  ApXcp START
**********************************************************************************************************************/

#ifdef APXCP_START_SEC_VAR_NOINIT_8
	#undef APXCP_START_SEC_VAR_NOINIT_8
	#define START_SEC_VAR_NOINIT_8BIT_6
#endif
#ifdef APXCP_STOP_SEC_VAR_NOINIT_8
	#undef APXCP_STOP_SEC_VAR_NOINIT_8
	#define STOP_SEC_VAR
#endif

#ifdef APXCP_START_SEC_VAR_NOINIT_32
	#undef APXCP_START_SEC_VAR_NOINIT_32
	#define START_SEC_VAR_NOINIT_32BIT_6
#endif
#ifdef APXCP_STOP_SEC_VAR_NOINIT_32
	#undef APXCP_STOP_SEC_VAR_NOINIT_32
	#define STOP_SEC_VAR
#endif

#ifdef APXCP_START_SEC_VAR_INIT_UNSPECIFIED
	#undef APXCP_START_SEC_VAR_INIT_UNSPECIFIED
	#define START_SEC_VAR_INIT_UNSPECIFIED_GLOBALSHARED
#endif
#ifdef APXCP_STOP_SEC_VAR_INIT_UNSPECIFIED
	#undef APXCP_STOP_SEC_VAR_INIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef APXCP_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef APXCP_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef APXCP_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef APXCP_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef APXCP_START_SEC_VAR_CLEARED_8
	#undef APXCP_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_6
#endif
#ifdef APXCP_STOP_SEC_VAR_CLEARED_8
	#undef APXCP_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef APXCP_START_SEC_VAR_CLEARED_BOOLEAN
	#undef APXCP_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef APXCP_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef APXCP_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  ApXcp END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Assist START
**********************************************************************************************************************/

#ifdef ASSIST_START_SEC_VAR_CLEARED_16
	#undef ASSIST_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef ASSIST_STOP_SEC_VAR_CLEARED_16
	#undef ASSIST_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  Assist END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  AssistFirewall START
**********************************************************************************************************************/

#ifdef ASSISTFIREWALL_START_SEC_VAR_CLEARED_16
	#undef ASSISTFIREWALL_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef ASSISTFIREWALL_STOP_SEC_VAR_CLEARED_16
	#undef ASSISTFIREWALL_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef ASSISTFIREWALL_START_SEC_VAR_CLEARED_32
	#undef ASSISTFIREWALL_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef ASSISTFIREWALL_STOP_SEC_VAR_CLEARED_32
	#undef ASSISTFIREWALL_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef ASSISTFIREWALL_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef ASSISTFIREWALL_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef ASSISTFIREWALL_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef ASSISTFIREWALL_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef ASSISTFIREWALL_START_SEC_VAR_CLEARED_BOOLEAN
	#undef ASSISTFIREWALL_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef ASSISTFIREWALL_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef ASSISTFIREWALL_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  AssistFirewall END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  AstLmt START
*********************************************************************************************************************/

#ifdef ASTLMT_START_SEC_VAR_CLEARED_32
	#undef ASTLMT_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef ASTLMT_STOP_SEC_VAR_CLEARED_32
	#undef ASTLMT_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef ASTLMT_START_SEC_VAR_CLEARED_BOOLEAN
	#undef ASTLMT_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef ASTLMT_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef ASTLMT_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef ASTLMT_START_SEC_VAR_CLEARED_16
	#undef ASTLMT_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef ASTLMT_STOP_SEC_VAR_CLEARED_16
	#undef ASTLMT_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  AstLmt END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Atan2_NxtrLib START
**********************************************************************************************************************/

#ifdef ATAN2_START_SEC_VAR_INIT_32
	#undef ATAN2_START_SEC_VAR_INIT_32
	#define START_SEC_VAR_INIT_32BIT_10
#endif
#ifdef ATAN2_STOP_SEC_VAR_INIT_32
	#undef ATAN2_STOP_SEC_VAR_INIT_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  Atan2_NxtrLib END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  AvgFricLrn START
**********************************************************************************************************************/

#ifdef AVGFRICLRN_START_SEC_VAR_CLEARED_32
	#undef AVGFRICLRN_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef AVGFRICLRN_STOP_SEC_VAR_CLEARED_32
	#undef AVGFRICLRN_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

