sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef AVGFRICLRN_START_SEC_VAR_CLEARED_BOOLEAN
	#undef AVGFRICLRN_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_8BIT_9
#endif
#ifdef AVGFRICLRN_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef AVGFRICLRN_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef AVGFRICLRN_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef AVGFRICLRN_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef AVGFRICLRN_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef AVGFRICLRN_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  AvgFricLrn END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  BatteryVoltage START
*********************************************************************************************************************/

#ifdef BATTERYVOLTAGE_START_SEC_VAR_CLEARED_32
	#undef BATTERYVOLTAGE_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef BATTERYVOLTAGE_STOP_SEC_VAR_CLEARED_32
	#undef BATTERYVOLTAGE_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef BATTERYVOLTAGE_START_SEC_VAR_CLEARED_16
	#undef BATTERYVOLTAGE_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef BATTERYVOLTAGE_STOP_SEC_VAR_CLEARED_16
	#undef BATTERYVOLTAGE_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef BATTERYVOLTAGE_START_SEC_VAR_CLEARED_BOOLEAN
	#undef BATTERYVOLTAGE_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_8BIT_9
#endif
#ifdef BATTERYVOLTAGE_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef BATTERYVOLTAGE_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  BatteryVoltage END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  BkCpPc START
**********************************************************************************************************************/

#ifdef BKCPPC_START_SEC_VAR_CLEARED_16
	#undef BKCPPC_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef BKCPPC_STOP_SEC_VAR_CLEARED_16
	#undef BKCPPC_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef BKCPPC_START_SEC_VAR_CLEARED_32
	#undef BKCPPC_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef BKCPPC_STOP_SEC_VAR_CLEARED_32
	#undef BKCPPC_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef BKCPPC_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef BKCPPC_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef BKCPPC_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef BKCPPC_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  BkCpPc END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  BVDiag START
**********************************************************************************************************************/

#ifdef BVDIAG_START_SEC_VAR_CLEARED_32
	#undef BVDIAG_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef BVDIAG_STOP_SEC_VAR_CLEARED_32
	#undef BVDIAG_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  BVDiag END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  CalConstants START
**********************************************************************************************************************/

#ifdef CALCONSTANTS_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef CALCONSTANTS_START_SEC_VAR_NOINIT_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_32BIT_11
#endif
#ifdef CALCONSTANTS_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef CALCONSTANTS_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  CalConstants END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  CDDData START
**********************************************************************************************************************/

#ifdef CDDDATA0_START_SEC_VAR_CLEARED_16
	#undef CDDDATA0_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_0
#endif
#ifdef CDDDATA0_STOP_SEC_VAR_CLEARED_16
	#undef CDDDATA0_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef CDDDATA0_START_SEC_VAR_CLEARED_32
	#undef CDDDATA0_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_0
#endif
#ifdef CDDDATA0_STOP_SEC_VAR_CLEARED_32
	#undef CDDDATA0_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef CDDDATA0_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef CDDDATA0_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_0
#endif
#ifdef CDDDATA0_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef CDDDATA0_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif


#ifdef CDDDATA6_START_SEC_VAR_CLEARED_8
	#undef CDDDATA6_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_6
#endif
#ifdef CDDDATA6_STOP_SEC_VAR_CLEARED_8
	#undef CDDDATA6_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef CDDDATA6_START_SEC_VAR_CLEARED_32
	#undef CDDDATA6_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_6
#endif
#ifdef CDDDATA6_STOP_SEC_VAR_CLEARED_32
	#undef CDDDATA6_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef CDDDATA6_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef CDDDATA6_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef CDDDATA6_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef CDDDATA6_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif


#ifdef CDDDATA9_START_SEC_VAR_CLEARED_16
	#undef CDDDATA9_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef CDDDATA9_STOP_SEC_VAR_CLEARED_16
	#undef CDDDATA9_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef CDDDATA9_START_SEC_VAR_CLEARED_32
	#undef CDDDATA9_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef CDDDATA9_STOP_SEC_VAR_CLEARED_32
	#undef CDDDATA9_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif


#ifdef CDDDATA10_START_SEC_VAR_CLEARED_8
	#undef CDDDATA10_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef CDDDATA10_STOP_SEC_VAR_CLEARED_8
	#undef CDDDATA10_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef CDDDATA10_START_SEC_VAR_CLEARED_BOOLEAN
	#undef CDDDATA10_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef CDDDATA10_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef CDDDATA10_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef CDDDATA10_START_SEC_VAR_CLEARED_16
	#undef CDDDATA10_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef CDDDATA10_STOP_SEC_VAR_CLEARED_16
	#undef CDDDATA10_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

