sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef CDDDATA10_START_SEC_VAR_CLEARED_32
	#undef CDDDATA10_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef CDDDATA10_STOP_SEC_VAR_CLEARED_32
	#undef CDDDATA10_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef CDDDATA10_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef CDDDATA10_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef CDDDATA10_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef CDDDATA10_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  CDDData END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  CDDInterface6 START
**********************************************************************************************************************/

#ifdef CDDINTERFACE6_START_SEC_VAR_CLEARED_8
	#undef CDDINTERFACE6_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_6
#endif
#ifdef CDDINTERFACE6_STOP_SEC_VAR_CLEARED_8
	#undef CDDINTERFACE6_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  CDDInterface6 END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  CDDInterface9 START
**********************************************************************************************************************/

#ifdef CDDINTERFACE9_STOP_SEC_VAR_NOINIT_32
	#undef CDDINTERFACE9_STOP_SEC_VAR_NOINIT_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  CDDInterface9 END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  CmMtrCurr START
**********************************************************************************************************************/

#ifdef CMMTRCURR_START_SEC_VAR_CLEARED_16
	#undef CMMTRCURR_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_11
#endif
#ifdef CMMTRCURR_STOP_SEC_VAR_CLEARED_16
	#undef CMMTRCURR_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef CMMTRCURR_START_SEC_VAR_CLEARED_32
	#undef CMMTRCURR_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_11
#endif
#ifdef CMMTRCURR_STOP_SEC_VAR_CLEARED_32
	#undef CMMTRCURR_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef CMMTRCURR_START_SEC_VAR_CLEARED_BOOLEAN
	#undef CMMTRCURR_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_8BIT_11
#endif
#ifdef CMMTRCURR_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef CMMTRCURR_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef CMMTRCURR_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef CMMTRCURR_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_11
#endif
#ifdef CMMTRCURR_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef CMMTRCURR_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  CmMtrCurr END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  CMS_Common START
**********************************************************************************************************************/

#ifdef EPSDIAGSRVC_START_SEC_CONST_8
	#undef EPSDIAGSRVC_START_SEC_CONST_8
	#define START_SEC_CONST_8BIT
#endif
#ifdef EPSDIAGSRVC_STOP_SEC_CONST_8
	#undef EPSDIAGSRVC_STOP_SEC_CONST_8
	#define STOP_SEC_VAR
#endif

#ifdef EPSDIAGSRVC_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef EPSDIAGSRVC_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef EPSDIAGSRVC_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef EPSDIAGSRVC_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef EPSDIAGSRVC_START_SEC_VAR_CLEARED_BOOLEAN
	#undef EPSDIAGSRVC_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef EPSDIAGSRVC_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef EPSDIAGSRVC_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef EPSDIAGSRVC_START_SEC_VAR_CLEARED_32
	#undef EPSDIAGSRVC_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_6
#endif
#ifdef EPSDIAGSRVC_STOP_SEC_VAR_CLEARED_32
	#undef EPSDIAGSRVC_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef EPSDIAGSRVC_START_SEC_VAR_CLEARED_16
	#undef EPSDIAGSRVC_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_6
#endif
#ifdef EPSDIAGSRVC_STOP_SEC_VAR_CLEARED_16
	#undef EPSDIAGSRVC_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef EPSDIAGSRVC_START_SEC_VAR_CLEARED_8
	#undef EPSDIAGSRVC_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_6
#endif
#ifdef EPSDIAGSRVC_STOP_SEC_VAR_CLEARED_8
	#undef EPSDIAGSRVC_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef EPSXCPSRVC_START_SEC_VAR_CLEARED_16
	#undef EPSXCPSRVC_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_6
#endif
#ifdef EPSXCPSRVC_STOP_SEC_VAR_CLEARED_16
	#undef EPSXCPSRVC_STOP_SEC_VAR_16
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  CMS_Common END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  CtrlTemp START
**********************************************************************************************************************/

