sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef CTRLTEMP_START_SEC_VAR_CLEARED_32
	#undef CTRLTEMP_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_11
#endif
#ifdef CTRLTEMP_STOP_SEC_VAR_CLEARED_32
	#undef CTRLTEMP_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef CTRLTEMP_START_SEC_VAR_CLEARED_16
	#undef CTRLTEMP_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_11
#endif
#ifdef CTRLTEMP_STOP_SEC_VAR_CLEARED_16
	#undef CTRLTEMP_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef CTRLTEMP_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef CTRLTEMP_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_11
#endif
#ifdef CTRLTEMP_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef CTRLTEMP_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  CtrlTemp END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  CurrCmd START
**********************************************************************************************************************/

#ifdef CURRCMD_START_SEC_VAR_CLEARED_32
	#undef CURRCMD_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef CURRCMD_STOP_SEC_VAR_CLEARED_32
	#undef CURRCMD_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef CURRCMD_START_SEC_VAR_CLEARED_16
	#undef CURRCMD_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef CURRCMD_STOP_SEC_VAR_CLEARED_16
	#undef CURRCMD_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef CURRCMD_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef CURRCMD_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef CURRCMD_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef CURRCMD_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  CurrCmd END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  CurrParamComp START
**********************************************************************************************************************/

#ifdef CURRPARAMCOMP_START_SEC_VAR_CLEARED_32
	#undef CURRPARAMCOMP_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef CURRPARAMCOMP_STOP_SEC_VAR_CLEARED_32
	#undef CURRPARAMCOMP_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  CurrParamComp END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  CustBattDiag START
**********************************************************************************************************************/

#ifdef CUSTBATTDIAG_START_SEC_VAR_CLEARED_32
	#undef CUSTBATTDIAG_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef CUSTBATTDIAG_STOP_SEC_VAR_CLEARED_32
	#undef CUSTBATTDIAG_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef CUSTBATTDIAG_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef CUSTBATTDIAG_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef CUSTBATTDIAG_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef CUSTBATTDIAG_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef CUSTBATTDIAG_START_SEC_CONST_16
	#undef CUSTBATTDIAG_START_SEC_CONST_16
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef CUSTBATTDIAG_STOP_SEC_CONST_16
	#undef CUSTBATTDIAG_STOP_SEC_CONST_16
	#define STOP_SEC_CONST
#endif

#ifdef CUSTBATTDIAG_START_SEC_CONST_UNSPECIFIED
	#undef CUSTBATTDIAG_START_SEC_CONST_UNSPECIFIED
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef CUSTBATTDIAG_STOP_SEC_CONST_UNSPECIFIED
	#undef CUSTBATTDIAG_STOP_SEC_CONST_UNSPECIFIED
	#define STOP_SEC_CONST
#endif

/**********************************************************************************************************************
*  CustBattDiag END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Damping START
**********************************************************************************************************************/

#ifdef DAMPING_START_SEC_VAR_CLEARED_16
	#undef DAMPING_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef DAMPING_STOP_SEC_VAR_CLEARED_16
	#undef DAMPING_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef DAMPING_START_SEC_VAR_CLEARED_32
	#undef DAMPING_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef DAMPING_STOP_SEC_VAR_CLEARED_32
	#undef DAMPING_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef DAMPING_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DAMPING_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef DAMPING_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DAMPING_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  Damping END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  DampingFirewall START
**********************************************************************************************************************/

#ifdef DAMPINGFIREWALL_START_SEC_VAR_CLEARED_32
	#undef DAMPINGFIREWALL_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef DAMPINGFIREWALL_STOP_SEC_VAR_CLEARED_32
	#undef DAMPINGFIREWALL_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef DAMPINGFIREWALL_START_SEC_VAR_CLEARED_16
	#undef DAMPINGFIREWALL_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef DAMPINGFIREWALL_STOP_SEC_VAR_CLEARED_16
	#undef DAMPINGFIREWALL_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

