sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef DAMPINGFIREWALL_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DAMPINGFIREWALL_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef DAMPINGFIREWALL_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DAMPINGFIREWALL_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef DAMPINGFIREWALL_START_SEC_VAR_CLEARED_BOOLEAN
	#undef DAMPINGFIREWALL_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef DAMPINGFIREWALL_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef DAMPINGFIREWALL_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif
/**********************************************************************************************************************
*  DampingFirewall END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Dem START
**********************************************************************************************************************/

#ifdef DEM_START_SEC_CODE
	#undef DEM_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef DEM_STOP_SEC_CODE
	#undef DEM_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef DEM_START_SEC_VAR_8BIT
	#undef DEM_START_SEC_VAR_8BIT
	#define START_SEC_VAR_INIT_8BIT_6
#endif
#ifdef DEM_STOP_SEC_VAR_8BIT
	#undef DEM_STOP_SEC_VAR_8BIT
	#define STOP_SEC_VAR
#endif

#ifdef DEM_START_SEC_VAR_32BIT
	#undef DEM_START_SEC_VAR_32BIT
	#define START_SEC_VAR_INIT_32BIT_6
#endif
#ifdef DEM_STOP_SEC_VAR_32BIT
	#undef DEM_STOP_SEC_VAR_32BIT
	#define STOP_SEC_VAR
#endif

#ifdef DEM_START_SEC_VAR_FAST_8BIT
	#undef DEM_START_SEC_VAR_FAST_8BIT
	#define START_SEC_VAR_NOINIT_8BIT_6
#endif
#ifdef DEM_STOP_SEC_VAR_FAST_8BIT
	#undef DEM_STOP_SEC_VAR_FAST_8BIT
	#define STOP_SEC_VAR
#endif

#ifdef DEM_START_SEC_VAR_FAST_16BIT
	#undef DEM_START_SEC_VAR_FAST_16BIT
	#define START_SEC_VAR_NOINIT_16BIT_6
#endif
#ifdef DEM_STOP_SEC_VAR_FAST_16BIT
	#undef DEM_STOP_SEC_VAR_FAST_16BIT
	#define STOP_SEC_VAR
#endif

#ifdef DEM_START_SEC_VAR_FAST_32BIT
	#undef DEM_START_SEC_VAR_FAST_32BIT
	#define START_SEC_VAR_NOINIT_32BIT_6
#endif
#ifdef DEM_STOP_SEC_VAR_FAST_32BIT
	#undef DEM_STOP_SEC_VAR_FAST_32BIT
	#define STOP_SEC_VAR
#endif

#ifdef DEM_START_SEC_VAR_NOINIT_8BIT
	#undef DEM_START_SEC_VAR_NOINIT_8BIT
	#define START_SEC_VAR_NOINIT_8BIT_6
#endif
#ifdef DEM_STOP_SEC_VAR_NOINIT_8BIT
	#undef DEM_STOP_SEC_VAR_NOINIT_8BIT
	#define STOP_SEC_VAR
#endif

#ifdef DEM_START_SEC_VAR_NOINIT_16BIT
	#undef DEM_START_SEC_VAR_NOINIT_16BIT
	#define START_SEC_VAR_NOINIT_16BIT_6
#endif
#ifdef DEM_STOP_SEC_VAR_NOINIT_16BIT
	#undef DEM_STOP_SEC_VAR_NOINIT_16BIT
	#define STOP_SEC_VAR
#endif

#ifdef DEM_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef DEM_START_SEC_VAR_NOINIT_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_6
#endif
#ifdef DEM_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef DEM_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef DEM_START_SEC_VAR_SAVED_ZONE0_UNSPECIFIED
	#undef DEM_START_SEC_VAR_SAVED_ZONE0_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_6
#endif
#ifdef DEM_STOP_SEC_VAR_SAVED_ZONE0_UNSPECIFIED
	#undef DEM_STOP_SEC_VAR_SAVED_ZONE0_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef DEM_START_SEC_CONST_8BIT
	#undef DEM_START_SEC_CONST_8BIT
	#define START_SEC_CONST_8BIT
#endif
#ifdef DEM_STOP_SEC_CONST_8BIT
	#undef DEM_STOP_SEC_CONST_8BIT
	#define STOP_SEC_CONST
#endif

#ifdef DEM_START_SEC_CONST_32BIT
	#undef DEM_START_SEC_CONST_32BIT
	#define START_SEC_CONST_32BIT
#endif
#ifdef DEM_STOP_SEC_CONST_32BIT
	#undef DEM_STOP_SEC_CONST_32BIT
	#define STOP_SEC_CONST
#endif

#ifdef DEM_START_SEC_CONST_UNSPECIFIED
	#undef DEM_START_SEC_CONST_UNSPECIFIED
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef DEM_STOP_SEC_CONST_UNSPECIFIED
	#undef DEM_STOP_SEC_CONST_UNSPECIFIED
	#define STOP_SEC_CONST
#endif

#ifdef DEM_START_SEC_CONST_LCFG
	#undef DEM_START_SEC_CONST_LCFG
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef DEM_STOP_SEC_CONST_LCFG
	#undef DEM_STOP_SEC_CONST_LCFG
	#define STOP_SEC_CONST
#endif

#ifdef DEM_START_SEC_PBCONST_ROOT
	#undef DEM_START_SEC_PBCONST_ROOT
	#define START_SEC_CONST_PBCFG
#endif
#ifdef DEM_STOP_SEC_PBCONST_ROOT
	#undef DEM_STOP_SEC_PBCONST_ROOT
	#define STOP_SEC_CONST
#endif

#ifdef DEM_START_SEC_PBCONST
	#undef DEM_START_SEC_PBCONST
	#define START_SEC_CONST_PBCFG
#endif
#ifdef DEM_STOP_SEC_PBCONST
	#undef DEM_STOP_SEC_PBCONST
	#define STOP_SEC_CONST
#endif

/**********************************************************************************************************************
*  Dem END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  DemIf START
**********************************************************************************************************************/

#ifdef DEMIF_START_SEC_VAR_CLEARED_BOOLEAN
	#undef DEMIF_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_8BIT_6
#endif
#ifdef DEMIF_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef DEMIF_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef DEMIF_START_SEC_VAR_CLEARED_8
	#undef DEMIF_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_6
#endif
#ifdef DEMIF_STOP_SEC_VAR_CLEARED_8
	#undef DEMIF_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef DEMIF_START_SEC_VAR_CLEARED_32
    #undef DEMIF_START_SEC_VAR_CLEARED_32
    #define START_SEC_VAR_ZERO_INIT_32BIT_6
#endif
#ifdef DEMIF_STOP_SEC_VAR_CLEARED_32
    #undef DEMIF_STOP_SEC_VAR_CLEARED_32
    #define STOP_SEC_VAR
#endif

#ifdef DEMIF_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DEMIF_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef DEMIF_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DEMIF_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef DEMIF_START_SEC_CONST_UNSPECIFIED
	#undef DEMIF_START_SEC_CONST_UNSPECIFIED
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef DEMIF_STOP_SEC_CONST_UNSPECIFIED
	#undef DEMIF_STOP_SEC_CONST_UNSPECIFIED
	#define STOP_SEC_CONST
#endif

/**********************************************************************************************************************
*  DemIf END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  DfltConfigData START
**********************************************************************************************************************/

