sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef DFLTCONFIGDATA_START_SEC_VAR_NOINIT_8
	#undef DFLTCONFIGDATA_START_SEC_VAR_NOINIT_8
	#define START_SEC_VAR_NOINIT_8BIT_6
#endif
#ifdef DFLTCONFIGDATA_STOP_SEC_VAR_NOINIT_8
	#undef DFLTCONFIGDATA_STOP_SEC_VAR_NOINIT_8
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  DfltConfigData END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  DiagMgr START
**********************************************************************************************************************/

#ifdef DIAGMGR_START_SEC_VAR_SAVED_ZONEHGS_UNSPECIFIED
	#undef DIAGMGR_START_SEC_VAR_SAVED_ZONEHGS_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_GLOBALSHARED
#endif
#ifdef DIAGMGR_STOP_SEC_VAR_SAVED_ZONEHGS_UNSPECIFIED
	#undef DIAGMGR_STOP_SEC_VAR_SAVED_ZONEHGS_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef DIAGMGR_START_SEC_VAR_CLEARED_BOOLEAN
	#undef DIAGMGR_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_8BIT_GLOBALSHARED
#endif
#ifdef DIAGMGR_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef DIAGMGR_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef DIAGMGR_START_SEC_CONST_UNSPECIFIED
	#undef DIAGMGR_START_SEC_CONST_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif
#ifdef DIAGMGR_STOP_SEC_CONST_UNSPECIFIED
	#undef DIAGMGR_STOP_SEC_CONST_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif

/**********************************************************************************************************************
*  DiagMgr END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  DiagMgr6 START
**********************************************************************************************************************/

#ifdef DIAGMGR6_START_SEC_VAR_CLEARED_8
	#undef DIAGMGR6_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_6
#endif
#ifdef DIAGMGR6_STOP_SEC_VAR_CLEARED_8
	#undef DIAGMGR6_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef DIAGMGR6_START_SEC_VAR_CLEARED_16
	#undef DIAGMGR6_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_6
#endif
#ifdef DIAGMGR6_STOP_SEC_VAR_CLEARED_16
	#undef DIAGMGR6_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef DIAGMGR6_START_SEC_VAR_CLEARED_32
	#undef DIAGMGR6_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_6
#endif
#ifdef DIAGMGR6_STOP_SEC_VAR_CLEARED_32
	#undef DIAGMGR6_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef DIAGMGR6_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DIAGMGR6_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef DIAGMGR6_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DIAGMGR6_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  DiagMgr8 END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  DiagMgr9 START
**********************************************************************************************************************/

#ifdef DIAGMGR9_START_SEC_VAR_CLEARED_8
	#undef DIAGMGR9_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_9
#endif
#ifdef DIAGMGR9_STOP_SEC_VAR_CLEARED_8
	#undef DIAGMGR9_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef DIAGMGR9_START_SEC_VAR_CLEARED_16
	#undef DIAGMGR9_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef DIAGMGR9_STOP_SEC_VAR_CLEARED_16
	#undef DIAGMGR9_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef DIAGMGR9_START_SEC_VAR_CLEARED_32
	#undef DIAGMGR9_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef DIAGMGR9_STOP_SEC_VAR_CLEARED_32
	#undef DIAGMGR9_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef DIAGMGR9_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DIAGMGR9_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef DIAGMGR9_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DIAGMGR9_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  DiagMgr9 END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  DiagMgr10 START
**********************************************************************************************************************/

#ifdef DIAGMGR10_START_SEC_VAR_CLEARED_8
	#undef DIAGMGR10_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef DIAGMGR10_STOP_SEC_VAR_CLEARED_8
	#undef DIAGMGR10_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef DIAGMGR10_START_SEC_VAR_CLEARED_16
	#undef DIAGMGR10_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef DIAGMGR10_STOP_SEC_VAR_CLEARED_16
	#undef DIAGMGR10_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef DIAGMGR10_START_SEC_VAR_CLEARED_32
	#undef DIAGMGR10_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef DIAGMGR10_STOP_SEC_VAR_CLEARED_32
	#undef DIAGMGR10_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef DIAGMGR10_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DIAGMGR10_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef DIAGMGR10_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DIAGMGR10_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  DiagMgr10 END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  DiagMgr11 START
**********************************************************************************************************************/

#ifdef DIAGMGR11_START_SEC_VAR_CLEARED_8
	#undef DIAGMGR11_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_11
#endif
#ifdef DIAGMGR11_STOP_SEC_VAR_CLEARED_8
	#undef DIAGMGR11_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

