sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef DIAGMGR11_START_SEC_VAR_CLEARED_16
	#undef DIAGMGR11_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_11
#endif
#ifdef DIAGMGR11_STOP_SEC_VAR_CLEARED_16
	#undef DIAGMGR11_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef DIAGMGR11_START_SEC_VAR_CLEARED_32
	#undef DIAGMGR11_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_11
#endif
#ifdef DIAGMGR11_STOP_SEC_VAR_CLEARED_32
	#undef DIAGMGR11_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef DIAGMGR11_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DIAGMGR11_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_11
#endif
#ifdef DIAGMGR11_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DIAGMGR11_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  DiagMgr8 END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  DiagMgrDemIf START
**********************************************************************************************************************/

#ifdef DIAGMGRDEMIF_START_SEC_VAR_16
	#undef DIAGMGRDEMIF_START_SEC_VAR_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_6
#endif
#ifdef DIAGMGRDEMIF_STOP_SEC_VAR_16
	#undef DIAGMGRDEMIF_STOP_SEC_VAR_16
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  DiagMgrDemIf END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  DiagSvc START
**********************************************************************************************************************/

#ifdef DIAGSVC_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DIAGSVC_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef DIAGSVC_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DIAGSVC_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef DIAGSVC_START_SEC_VAR_CLEARED_BOOLEAN
	#undef DIAGSVC_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef DIAGSVC_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef DIAGSVC_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef DIAGSVC_START_SEC_VAR_CLEARED_8
	#undef DIAGSVC_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_6
#endif
#ifdef DIAGSVC_STOP_SEC_VAR_CLEARED_8
	#undef DIAGSVC_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  DiagSvc END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  DigMSB START
**********************************************************************************************************************/

#ifdef DIGMSB_START_SEC_VAR_CLEARED_BOOLEAN
	#undef DIGMSB_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef DIGMSB_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef DIGMSB_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef DIGMSB_START_SEC_VAR_CLEARED_8
	#undef DIGMSB_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef DIGMSB_STOP_SEC_VAR_CLEARED_8
	#undef DIGMSB_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef DIGMSB_START_SEC_VAR_CLEARED_16
	#undef DIGMSB_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef DIGMSB_STOP_SEC_VAR_CLEARED_16
	#undef DIGMSB_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef DIGMSB_START_SEC_VAR_CLEARED_32
	#undef DIGMSB_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef DIGMSB_STOP_SEC_VAR_CLEARED_32
	#undef DIGMSB_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef DIGMSB_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DIGMSB_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef DIGMSB_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DIGMSB_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef DIGMSB_START_SEC_CONST_8
	#undef DIGMSB_START_SEC_CONST_8
	#define START_SEC_CONST_8BIT
#endif
#ifdef DIGMSB_STOP_SEC_CONST_8
	#undef DIGMSB_STOP_SEC_CONST_8
	#define STOP_SEC_CONST
#endif

/**********************************************************************************************************************
*  DigMSB END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  DigPhsReasDiag START
**********************************************************************************************************************/

#ifdef DIGPHSREASDIAG_START_SEC_VAR_CLEARED_32
	#undef DIGPHSREASDIAG_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef DIGPHSREASDIAG_STOP_SEC_VAR_CLEARED_32
	#undef DIGPHSREASDIAG_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef DIGPHSREASDIAG_START_SEC_VAR_CLEARED_16
	#undef DIGPHSREASDIAG_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef DIGPHSREASDIAG_STOP_SEC_VAR_CLEARED_16
	#undef DIGPHSREASDIAG_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef DIGPHSREASDIAG_START_SEC_VAR_CLEARED_8
	#undef DIGPHSREASDIAG_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef DIGPHSREASDIAG_STOP_SEC_VAR_CLEARED_8
	#undef DIGPHSREASDIAG_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef DIGPHSREASDIAG_START_SEC_VAR_CLEARED_BOOLEAN
	#undef DIGPHSREASDIAG_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef DIGPHSREASDIAG_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef DIGPHSREASDIAG_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  DigPhsReasDiag END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Dma START
**********************************************************************************************************************/

#ifdef DMA_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DMA_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_0
#endif
#ifdef DMA_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef DMA_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef DMA_START_SEC_VAR_CLEARED_BOOLEAN
	#undef DMA_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_0
#endif
#ifdef DMA_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef DMA_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  Dma END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  ElePwr START
**********************************************************************************************************************/

#ifdef ELEPWR_START_SEC_VAR_CLEARED_32
	#undef ELEPWR_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef ELEPWR_STOP_SEC_VAR_CLEARED_32
	#undef ELEPWR_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  ElePwr END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  ePWM START
**********************************************************************************************************************/

#ifdef EPWM_START_SEC_CODE
	#undef EPWM_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef EPWM_STOP_SEC_CODE
	#undef EPWM_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

/**********************************************************************************************************************
*  ePWM END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  EOTActuatorMng START
**********************************************************************************************************************/

