sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef EOTACTUATORMNG_START_SEC_VAR_CLEARED_32
	#undef EOTACTUATORMNG_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef EOTACTUATORMNG_STOP_SEC_VAR_CLEARED_32
	#undef EOTACTUATORMNG_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef EOTACTUATORMNG_START_SEC_VAR_CLEARED_BOOLEAN
	#undef EOTACTUATORMNG_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_8BIT_9
#endif
#ifdef EOTACTUATORMNG_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef EOTACTUATORMNG_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef EOTACTUATORMNG_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef EOTACTUATORMNG_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef EOTACTUATORMNG_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef EOTACTUATORMNG_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  EOTActuatorMng END
**********************************************************************************************************************/


/**********************************************************************************************************************
*  EtDmpFw START
**********************************************************************************************************************/

#ifdef ETDMPFW_START_SEC_VAR_CLEARED_08
	#undef ETDMPFW_START_SEC_VAR_CLEARED_08
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef ETDMPFW_STOP_SEC_VAR_CLEARED_08
	#undef ETDMPFW_STOP_SEC_VAR_CLEARED_08
	#define STOP_SEC_VAR
#endif

#ifdef ETDMPFW_START_SEC_VAR_CLEARED_32
	#undef ETDMPFW_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef ETDMPFW_STOP_SEC_VAR_CLEARED_32
	#undef ETDMPFW_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef ETDMPFW_START_SEC_VAR_CLEARED_BOOLEAN
	#undef ETDMPFW_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef ETDMPFW_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef ETDMPFW_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  EtDmpFw END
**********************************************************************************************************************/


/**********************************************************************************************************************
*  FaultLog START
**********************************************************************************************************************/

#ifdef FAULTLOG_START_SEC_VAR_CLEARED_32
	#undef FAULTLOG_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_6
#endif
#ifdef FAULTLOG_STOP_SEC_VAR_CLEARED_32
	#undef FAULTLOG_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef FAULTLOG_START_SEC_VAR_CLEARED_16
	#undef FAULTLOG_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_6
#endif
#ifdef FAULTLOG_STOP_SEC_VAR_CLEARED_16
	#undef FAULTLOG_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef FAULTLOG_START_SEC_VAR_CLEARED_8
	#undef FAULTLOG_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_6
#endif
#ifdef FAULTLOG_STOP_SEC_VAR_CLEARED_8
	#undef FAULTLOG_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef FAULTLOG_START_SEC_VAR_CLEARED_BOOLEAN
	#undef FAULTLOG_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef FAULTLOG_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef FAULTLOG_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  FaultLog END
**********************************************************************************************************************/


/**********************************************************************************************************************
*  Fbl START
**********************************************************************************************************************/

#ifdef FBLHEADER_START_SEC_CONST_EXPORT
	#undef FBLHEADER_START_SEC_CONST_EXPORT
	#define CONST_SEC_OPEN
	#pragma SET_DATA_SECTION(".FblHeader")
	#undef MEMMAP_ERROR
#endif
#ifdef FBLHEADER_STOP_SEC_CONST_EXPORT
	#undef FBLHEADER_STOP_SEC_CONST_EXPORT
	#define STOP_SEC_CONST
#endif

#ifdef MAGICFLAG_START_SEC_DATA_EXPORT
	#undef MAGICFLAG_START_SEC_DATA_EXPORT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".MagicFlag")
	#undef MEMMAP_ERROR
#endif
#ifdef MAGICFLAG_STOP_SEC_DATA_EXPORT
	#undef MAGICFLAG_STOP_SEC_DATA_EXPORT
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  Fbl END
**********************************************************************************************************************/


/**********************************************************************************************************************
*  FlsTst START
**********************************************************************************************************************/

#ifdef FLSTST_START_SEC_CONST_UNSPECIFIED
	#undef MEMMAP_ERROR
	#undef FLSTST_START_SEC_CONST_UNSPECIFIED
#endif
#ifdef FLSTST_STOP_SEC_CONST_UNSPECIFIED
	#undef MEMMAP_ERROR
	#undef FLSTST_STOP_SEC_CONST_UNSPECIFIED
#endif

#ifdef FLSTST_START_SEC_VAR_UNSPECIFIED
	#undef FLSTST_START_SEC_VAR_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_0
#endif
#ifdef FLSTST_STOP_SEC_VAR_UNSPECIFIED
	#undef FLSTST_STOP_SEC_VAR_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef FLSTST_START_SEC_VAR_16
	#undef FLSTST_START_SEC_VAR_16
	#define START_SEC_VAR_NOINIT_16BIT_0
#endif
#ifdef FLSTST_STOP_SEC_VAR_16
	#undef FLSTST_STOP_SEC_VAR_16
	#define STOP_SEC_VAR
#endif

#ifdef FLSTST_START_SEC_VAR_CLEARED_8
	#undef FLSTST_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_0
#endif
#ifdef FLSTST_STOP_SEC_VAR_CLEARED_8
	#undef FLSTST_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef FLSTST_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef FLSTST_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_0
#endif
#ifdef FLSTST_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef FLSTST_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef FLSTST_START_SEC_CODE
	#undef MEMMAP_ERROR
	#undef FLSTST_START_SEC_CODE
#endif
#ifdef FLSTST_STOP_SEC_CODE
	#undef MEMMAP_ERROR
	#undef FLSTST_STOP_SEC_CODE
#endif

/**********************************************************************************************************************
*  FlsTst END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  FltInjection START
**********************************************************************************************************************/

#ifdef FLTINJECTION_START_SEC_VAR_CLEARED_32
	#undef FLTINJECTION_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_GLOBALSHARED
#endif
#ifdef FLTINJECTION_STOP_SEC_VAR_CLEARED_32
	#undef FLTINJECTION_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

