sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef FLTINJECTION_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef FLTINJECTION_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_GLOBALSHARED
#endif
#ifdef FLTINJECTION_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef FLTINJECTION_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  FltInjection END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  FrqDepDmpnInrtCmp START
**********************************************************************************************************************/

#ifdef FRQDEPDMPNINRTCMP_START_SEC_VAR_CLEARED_32
	#undef FRQDEPDMPNINRTCMP_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef FRQDEPDMPNINRTCMP_STOP_SEC_VAR_CLEARED_32
	#undef FRQDEPDMPNINRTCMP_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef FRQDEPDMPNINRTCMP_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef FRQDEPDMPNINRTCMP_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef FRQDEPDMPNINRTCMP_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef FRQDEPDMPNINRTCMP_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  FrqDepDmpnInrtCmp END
**********************************************************************************************************************/


/**********************************************************************************************************************
*  HighFreqAssist START
**********************************************************************************************************************/

#ifdef HIGHFREQASSIST_START_SEC_VAR_CLEARED_32
	#undef HIGHFREQASSIST_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef HIGHFREQASSIST_STOP_SEC_VAR_CLEARED_32
	#undef HIGHFREQASSIST_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef HYSTADD_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef HYSTADD_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef HYSTADD_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef HYSTADD_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  HighFreqAssist END
**********************************************************************************************************************/


/**********************************************************************************************************************
*  HiLoadStall START
**********************************************************************************************************************/

#ifdef HILOADSTALL_START_SEC_VAR_CLEARED_16
	#undef HILOADSTALL_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef HILOADSTALL_STOP_SEC_VAR_CLEARED_16
	#undef HILOADSTALL_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef HILOADSTALL_START_SEC_VAR_CLEARED_32
	#undef HILOADSTALL_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef HILOADSTALL_STOP_SEC_VAR_CLEARED_32
	#undef HILOADSTALL_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  HiLoadStall END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  HOWDETECT START
**********************************************************************************************************************/

#ifdef HOWDETECT_START_SEC_CONST_16
	#undef HOWDETECT_START_SEC_CONST_16
	#define START_SEC_CONST_16BIT
#endif
#ifdef HOWDETECT_STOP_SEC_CONST_16
	#undef HOWDETECT_STOP_SEC_CONST_16
	#define STOP_SEC_VAR
#endif

#ifdef HOWDETECT_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef HOWDETECT_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef HOWDETECT_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef HOWDETECT_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef HOWDETECT_START_SEC_VAR_CLEARED_32
	#undef HOWDETECT_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef HOWDETECT_STOP_SEC_VAR_CLEARED_32
	#undef HOWDETECT_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  HOWDETECT END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  HwPwUp START
**********************************************************************************************************************/

#ifdef HWPWUP_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef HWPWUP_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef HWPWUP_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef HWPWUP_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef HWPWUP_START_SEC_VAR_CLEARED_BOOLEAN
	#undef HWPWUP_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef HWPWUP_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef HWPWUP_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  HwPwUp END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  HWTQCORRLN START
**********************************************************************************************************************/

