sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef HWTQCORRLN_START_SEC_VAR_CLEARED_8
	#undef HWTQCORRLN_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef HWTQCORRLN_STOP_SEC_VAR_CLEARED_8
	#undef HWTQCORRLN_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef HWTQCORRLN_START_SEC_VAR_CLEARED_BOOLEAN
	#undef HWTQCORRLN_START_SEC_VAR_CLEARED_BOOLEAN 
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef HWTQCORRLN_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef HWTQCORRLN_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef HWTQCORRLN_START_SEC_VAR_CLEARED_32
	#undef HWTQCORRLN_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef HWTQCORRLN_STOP_SEC_VAR_CLEARED_32
	#undef HWTQCORRLN_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef HWTQCORRLN_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef HWTQCORRLN_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef HWTQCORRLN_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef HWTQCORRLN_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef HWTQCORRLN_START_SEC_CODE
	#undef HWTQCORRLN_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef HWTQCORRLN_STOP_SEC_CODE
	#undef HWTQCORRLN_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

/**********************************************************************************************************************
*  HWTQCORRLN END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  HWTQARBN START
**********************************************************************************************************************/

#ifdef HWTQARBN_START_SEC_VAR_CLEARED_8
	#undef HWTQARBN_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef HWTQARBN_STOP_SEC_VAR_CLEARED_8
	#undef HWTQARBN_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef HWTQARBN_START_SEC_VAR_CLEARED_BOOLEAN
	#undef HWTQARBN_START_SEC_VAR_CLEARED_BOOLEAN 
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef HWTQARBN_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef HWTQARBN_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef HWTRQARBN_START_SEC_VAR_CLEARED_32
	#undef HWTRQARBN_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef HWTRQARBN_STOP_SEC_VAR_CLEARED_32
	#undef HWTRQARBN_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef HWTQARBN_START_SEC_CODE
	#undef HWTQARBN_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef HWTQARBN_STOP_SEC_CODE
	#undef HWTQARBN_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

/**********************************************************************************************************************
*  HWTQARBN END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  HystComp START
**********************************************************************************************************************/

#ifdef HYSTCOMP_START_SEC_VAR_CLEARED_16
	#undef HYSTCOMP_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef HYSTCOMP_STOP_SEC_VAR_CLEARED_16
	#undef HYSTCOMP_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef HYSTCOMP_START_SEC_VAR_CLEARED_32
	#undef HYSTCOMP_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef HYSTCOMP_STOP_SEC_VAR_CLEARED_32
	#undef HYSTCOMP_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef HYSTCOMP_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef HYSTCOMP_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef HYSTCOMP_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef HYSTCOMP_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  HystComp END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  IoHwAbstractionUsr10 START
**********************************************************************************************************************/

#ifdef IOHWABSTRACTIONUSR10_START_SEC_VAR_CLEARED_16
	#undef IOHWABSTRACTIONUSR10_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef IOHWABSTRACTIONUSR10_STOP_SEC_VAR_CLEARED_16
	#undef IOHWABSTRACTIONUSR10_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef IOHWABSTRACTIONUSR10_START_SEC_VAR_CLEARED_32
	#undef IOHWABSTRACTIONUSR10_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef IOHWABSTRACTIONUSR10_STOP_SEC_VAR_CLEARED_32
	#undef IOHWABSTRACTIONUSR10_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  LmtCod END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  LmtCod START
**********************************************************************************************************************/

#ifdef LMTCOD_START_SEC_VAR_CLEARED_32
	#undef LMTCOD_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef LMTCOD_STOP_SEC_VAR_CLEARED_32
	#undef LMTCOD_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  LmtCod END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  LrnEOT START
**********************************************************************************************************************/

#ifdef LRNEOT_START_SEC_VAR_CLEARED_32
	#undef LRNEOT_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef LRNEOT_STOP_SEC_VAR_CLEARED_32
	#undef LRNEOT_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef LRNEOT_START_SEC_VAR_CLEARED_BOOLEAN
	#undef LRNEOT_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_8BIT_9
#endif
#ifdef LRNEOT_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef LRNEOT_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  LrnEOT END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  LOAMGR START
**********************************************************************************************************************/

#ifdef LOAMGR_START_SEC_VAR_CLEARED_08
	#undef LOAMGR_START_SEC_VAR_CLEARED_08
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef LOAMGR_STOP_SEC_VAR_CLEARED_08
	#undef LOAMGR_STOP_SEC_VAR_CLEARED_08
	#define STOP_SEC_VAR
#endif

#ifdef LOAMGR_START_SEC_VAR_CLEARED_32
	#undef LOAMGR_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef LOAMGR_STOP_SEC_VAR_CLEARED_32
	#undef LOAMGR_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef LOAMGR_START_SEC_VAR_CLEARED_BOOLEAN
	#undef LOAMGR_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef LOAMGR_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef LOAMGR_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

