sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef LOAMGR_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef LOAMGR_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef LOAMGR_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef LOAMGR_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  LOAMGR END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  MtrCtrlISR START
**********************************************************************************************************************/

#ifdef MTRCTRLIRQ_START_SEC_VAR_CLEARED_16
	#undef MTRCTRLIRQ_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_0
#endif
#ifdef MTRCTRLIRQ_STOP_SEC_VAR_CLEARED_16
	#undef MTRCTRLIRQ_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  MtrCtrlISR END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  MtrDrvDiag START
**********************************************************************************************************************/

#ifdef MTRDRVDIAG_START_SEC_VAR_CLEARED_32
	#undef MTRDRVDIAG_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef MTRDRVDIAG_STOP_SEC_VAR_CLEARED_32
	#undef MTRDRVDIAG_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef MTRDRVDIAG_START_SEC_VAR_CLEARED_16
	#undef MTRDRVDIAG_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef MTRDRVDIAG_STOP_SEC_VAR_CLEARED_16
	#undef MTRDRVDIAG_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef MTRDRVDIAG_START_SEC_VAR_CLEARED_BOOLEAN
	#undef MTRDRVDIAG_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef MTRDRVDIAG_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef MTRDRVDIAG_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef MTRDRVDIAG_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef MTRDRVDIAG_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef MTRDRVDIAG_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef MTRDRVDIAG_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  MtrDrvDiag END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  MtrTempEst START
**********************************************************************************************************************/

#ifdef MTRTEMPEST_START_SEC_VAR_CLEARED_32
	#undef MTRTEMPEST_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_11
#endif
#ifdef MTRTEMPEST_STOP_SEC_VAR_CLEARED_32
	#undef MTRTEMPEST_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef MTRTEMPEST_START_SEC_VAR_CLEARED_BOOLEAN
	#undef MTRTEMPEST_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_11
#endif
#ifdef MTRTEMPEST_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef MTRTEMPEST_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef MTRTEMPEST_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef MTRTEMPEST_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_11
#endif
#ifdef MTRTEMPEST_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef MTRTEMPEST_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  MtrTempEst END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  MtrVel START
**********************************************************************************************************************/

#ifdef MTRVEL_START_SEC_VAR_CLEARED_32
	#undef MTRVEL_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef MTRVEL_STOP_SEC_VAR_CLEARED_32
	#undef MTRVEL_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef MTRVEL_START_SEC_VAR_CLEARED_16
	#undef MTRVEL_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef MTRVEL_STOP_SEC_VAR_CLEARED_16
	#undef MTRVEL_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef MTRVEL_START_SEC_VAR_CLEARED_8
	#undef MTRVEL_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef MTRVEL_STOP_SEC_VAR_CLEARED_8
	#undef MTRVEL_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  MtrVel END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  MtrVel2 START
**********************************************************************************************************************/

#ifdef MTRVEL2_START_SEC_VAR_CLEARED_32
	#undef MTRVEL2_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_11
#endif
#ifdef MTRVEL2_STOP_SEC_VAR_CLEARED_32
	#undef MTRVEL2_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef MTRVEL2_START_SEC_VAR_CLEARED_16
	#undef MTRVEL2_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_11
#endif
#ifdef MTRVEL2_STOP_SEC_VAR_CLEARED_16
	#undef MTRVEL2_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  MtrVel2 END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  MtrVel3 START
**********************************************************************************************************************/

