sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef MTRVEL3_START_SEC_VAR_CLEARED_8
	#undef MTRVEL3_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef MTRVEL3_STOP_SEC_VAR_CLEARED_8
	#undef MTRVEL3_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef MTRVEL3_START_SEC_VAR_CLEARED_16
	#undef MTRVEL3_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef MTRVEL3_STOP_SEC_VAR_CLEARED_16
	#undef MTRVEL3_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef MTRVEL3_START_SEC_VAR_CLEARED_32
	#undef MTRVEL3_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef MTRVEL3_STOP_SEC_VAR_CLEARED_32
	#undef MTRVEL3_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  MtrVel3 END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  NHET1CFGANDUSE START
**********************************************************************************************************************/

#ifdef NHET1CFGANDUSE_START_SEC_VAR_CLEARED_BOOLEAN
	#undef NHET1CFGANDUSE_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef NHET1CFGANDUSE_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef NHET1CFGANDUSE_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef NHET1CFGANDUSE_START_SEC_VAR_CLEARED_32
	#undef NHET1CFGANDUSE_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef NHET1CFGANDUSE_STOP_SEC_VAR_CLEARED_32
	#undef NHET1CFGANDUSE_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef NHET1CFGANDUSE_START_SEC_VAR_CLEARED_8
	#undef NHET1CFGANDUSE_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_9
#endif
#ifdef NHET1CFGANDUSE_STOP_SEC_VAR_CLEARED_8
	#undef NHET1CFGANDUSE_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef NHET1CFGANDUSE_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef NHET1CFGANDUSE_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef NHET1CFGANDUSE_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef NHET1CFGANDUSE_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef NHET1CFGANDUSE_START_SEC_CONST_8
	#undef NHET1CFGANDUSE_START_SEC_CONST_8
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef NHET1CFGANDUSE_STOP_SEC_CONST_8
	#undef NHET1CFGANDUSE_STOP_SEC_CONST_8
	#define STOP_SEC_CONST
#endif

/**********************************************************************************************************************
*  NHET1CFGANDUSE END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  NtWrap START
**********************************************************************************************************************/

#ifdef NTWRAP_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef NTWRAP_START_SEC_VAR_NOINIT_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_GLOBALSHARED
#endif
#ifdef NTWRAP_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef NTWRAP_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  NtWrap END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  NvMProxy START
**********************************************************************************************************************/

#ifdef NVMPROXY_START_SEC_CODE
	#undef NVMPROXY_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef NVMPROXY_STOP_SEC_CODE
	#undef NVMPROXY_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef NVMPROXY_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef NVMPROXY_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_GLOBALSHARED
#endif
#ifdef NVMPROXY_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef NVMPROXY_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef NVMPROXY_START_SEC_VAR_NOINIT_8
	#undef NVMPROXY_START_SEC_VAR_NOINIT_8
	#define START_SEC_VAR_NOINIT_8BIT_6
#endif
#ifdef NVMPROXY_STOP_SEC_VAR_NOINIT_8
	#undef NVMPROXY_STOP_SEC_VAR_NOINIT_8
	#define STOP_SEC_VAR
#endif

#ifdef NVMPROXY_START_SEC_CONST_UNSPECIFIED
	#undef NVMPROXY_START_SEC_CONST_UNSPECIFIED
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef NVMPROXY_STOP_SEC_CONST_UNSPECIFIED
	#undef NVMPROXY_STOP_SEC_CONST_UNSPECIFIED
	#define STOP_SEC_CONST
#endif

/**********************************************************************************************************************
*  NvMProxy END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  OvrVoltMon START
**********************************************************************************************************************/

#ifdef OVRVOLTMON_START_SEC_VAR_CLEARED_16
	#undef OVRVOLTMON_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef OVRVOLTMON_STOP_SEC_VAR_CLEARED_16
	#undef OVRVOLTMON_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  OvrVoltMon END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  PeakCurrEst START
**********************************************************************************************************************/

#ifdef PEAKCURREST_START_SEC_VAR_CLEARED_32
	#undef PEAKCURREST_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef PEAKCURREST_STOP_SEC_VAR_CLEARED_32
	#undef PEAKCURREST_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  PeakCurrEst END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  PHASEABCFDBKMEAS START
**********************************************************************************************************************/

#ifdef PHASEABCFDBKMEAS_START_SEC_VAR_CLEARED_32
	#undef PHASEABCFDBKMEAS_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif

#ifdef PHASEABCFDBKMEAS_STOP_SEC_VAR_CLEARED_32
	#undef PHASEABCFDBKMEAS_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  PHASEABCFDBKMEAS END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  PICurrContrl START
**********************************************************************************************************************/

