sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef PICURRCNTRL_START_SEC_VAR_CLEARED_32
	#undef PICURRCNTRL_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif

#ifdef PICURRCNTRL_STOP_SEC_VAR_CLEARED_32
	#undef PICURRCNTRL_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef PICURRCNTRL_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef PICURRCNTRL_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif

#ifdef PICURRCNTRL_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef PICURRCNTRL_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  PICurrContrl END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  PosServo START
**********************************************************************************************************************/

#ifdef POSSERVO_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef POSSERVO_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef POSSERVO_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef POSSERVO_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef POSSERVO_START_SEC_VAR_CLEARED_BOOLEAN
	#undef POSSERVO_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef POSSERVO_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef POSSERVO_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef POSSERVO_START_SEC_VAR_CLEARED_32
	#undef POSSERVO_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef POSSERVO_STOP_SEC_VAR_CLEARED_32
	#undef POSSERVO_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef POSSERVO_START_SEC_VAR_CLEARED_16
	#undef POSSERVO_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef POSSERVO_STOP_SEC_VAR_CLEARED_16
	#undef POSSERVO_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  PosServo END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  PSASH START
**********************************************************************************************************************/

#ifdef PSASH_START_SEC_VAR_CLEARED_BOOLEAN
	#undef PSASH_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef PSASH_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef PSASH_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef PSASH_START_SEC_VAR_INIT_8
	#undef PSASH_START_SEC_VAR_INIT_8
    #define START_SEC_VAR_ZERO_INIT_8BIT_9
#endif
#ifdef PSASH_STOP_SEC_VAR_INIT_8
	#undef PSASH_STOP_SEC_VAR_INIT_8
	#define STOP_SEC_VAR
#endif

#ifdef PSASH_START_SEC_VAR_CLEARED_8
	#undef PSASH_START_SEC_VAR_CLEARED_8
    #define START_SEC_VAR_ZERO_INIT_8BIT_9
#endif
#ifdef PSASH_STOP_SEC_VAR_CLEARED_8
	#undef PSASH_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef PSASH_START_SEC_VAR_CLEARED_32
	#undef PSASH_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef PSASH_STOP_SEC_VAR_CLEARED_32
	#undef PSASH_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef PSASH_START_SEC_VAR_INIT_16
	#undef PSASH_START_SEC_VAR_INIT_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef PSASH_STOP_SEC_VAR_INIT_16
	#undef PSASH_STOP_SEC_VAR_INIT_16
	#define STOP_SEC_VAR
#endif

#ifdef PSASH_START_SEC_VAR_CLEARED_16
	#undef PSASH_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef PSASH_STOP_SEC_VAR_CLEARED_16
	#undef PSASH_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef PSASH_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef PSASH_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef PSASH_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef PSASH_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  PSASH END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  PSADMQ START
**********************************************************************************************************************/

#ifdef PSADMQ_START_SEC_VAR_CLEARED_BOOLEAN
	#undef PSADMQ_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef PSADMQ_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef PSADMQ_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef PSADMQ_START_SEC_VAR_INIT_8
	#undef PSADMQ_START_SEC_VAR_INIT_8
    #define START_SEC_VAR_ZERO_INIT_8BIT_9
#endif
#ifdef PSADMQ_STOP_SEC_VAR_INIT_8
	#undef PSADMQ_STOP_SEC_VAR_INIT_8
	#define STOP_SEC_VAR
#endif

#ifdef PSADMQ_START_SEC_VAR_CLEARED_8
	#undef PSADMQ_START_SEC_VAR_CLEARED_8
    #define START_SEC_VAR_ZERO_INIT_8BIT_9
#endif
#ifdef PSADMQ_STOP_SEC_VAR_CLEARED_8
	#undef PSADMQ_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef PSADMQ_START_SEC_VAR_INIT_16
	#undef PSADMQ_START_SEC_VAR_INIT_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef PSADMQ_STOP_SEC_VAR_INIT_16
	#undef PSADMQ_STOP_SEC_VAR_INIT_16
	#define STOP_SEC_VAR
#endif

#ifdef PSADMQ_START_SEC_VAR_CLEARED_16
	#undef PSADMQ_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef PSADMQ_STOP_SEC_VAR_CLEARED_16
	#undef PSADMQ_STOP_SEC_VAR_INIT_16
	#define STOP_SEC_VAR
#endif

#ifdef PSADMQ_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef PSADMQ_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef PSADMQ_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef PSADMQ_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif
/**********************************************************************************************************************
*  PSADMQ END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  PSADSG START
**********************************************************************************************************************/

#ifdef PSADSG_START_SEC_VAR_CLEARED_32
	#undef PSADSG_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef PSADSG_STOP_SEC_VAR_CLEARED_32
	#undef PSADSG_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif


/**********************************************************************************************************************
*  PSADSG END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  PSATA START
**********************************************************************************************************************/

#ifdef PSATA_START_SEC_VAR_CLEARED_BOOLEAN
	#undef PSATA_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef PSATA_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef PSATA_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef PSATA_START_SEC_VAR_CLEARED_16
	#undef PSATA_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef PSATA_STOP_SEC_VAR_CLEARED_16
	#undef PSATA_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

