sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef PSATA_START_SEC_VAR_CLEARED_32
	#undef PSATA_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef PSATA_STOP_SEC_VAR_CLEARED_32
	#undef PSATA_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef PSATA_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef PSATA_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef PSATA_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef PSATA_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  PSATA END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  PSAAGARBN START
**********************************************************************************************************************/

#ifdef PSAAGARBN_START_SEC_VAR_CLEARED_BOOLEAN
	#undef PSAAGARBN_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef PSAAGARBN_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef PSAAGARBN_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef PSAAGARBN_START_SEC_VAR_CLEARED_32
	#undef PSAAGARBN_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef PSAAGARBN_STOP_SEC_VAR_CLEARED_32
	#undef PSAAGARBN_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef PSAAGARBN_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef PSAAGARBN_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef PSAAGARBN_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef PSAAGARBN_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  PSATA END
**********************************************************************************************************************/


/**********************************************************************************************************************
*  PwmCdd START
**********************************************************************************************************************/

#ifdef PWMCDD_START_SEC_VAR_CLEARED_16
	#undef PWMCDD_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_6
#endif
#ifdef PWMCDD_STOP_SEC_VAR_CLEARED_16
	#undef PWMCDD_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  PwmCdd END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  PwrLmtFuncCr START
**********************************************************************************************************************/

#ifdef PWRLMTFUNCCR_START_SEC_VAR_CLEARED_32
	#undef PWRLMTFUNCCR_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef PWRLMTFUNCCR_STOP_SEC_VAR_CLEARED_32
	#undef PWRLMTFUNCCR_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef PWRLMTFUNCCR_START_SEC_VAR_CLEARED_BOOLEAN
	#undef PWRLMTFUNCCR_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef PWRLMTFUNCCR_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef PWRLMTFUNCCR_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef PWRLMTFUNCCR_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef PWRLMTFUNCCR_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef PWRLMTFUNCCR_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef PWRLMTFUNCCR_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  PwrLmtFuncCr END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  QuadDet START
**********************************************************************************************************************/

#ifdef QUADDET_START_SEC_VAR_INIT_8
	#undef QUADDET_START_SEC_VAR_INIT_8
	#define START_SEC_VAR_INIT_8BIT_10
#endif
#ifdef QUADDET_STOP_SEC_VAR_INIT_8
	#undef QUADDET_STOP_SEC_VAR_INIT_8
	#define STOP_SEC_VAR
#endif

#ifdef QUADDET_START_SEC_VAR_INIT_32
	#undef QUADDET_START_SEC_VAR_INIT_32
	#define START_SEC_VAR_INIT_32BIT_10
#endif
#ifdef QUADDET_STOP_SEC_VAR_INIT_32
	#undef QUADDET_STOP_SEC_VAR_INIT_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  QuadDet END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  ResetCause START
**********************************************************************************************************************/

#ifdef RESETCAUSE_START_SEC_VAR_POWER_ON_CLEARED_8
	#undef RESETCAUSE_START_SEC_VAR_POWER_ON_CLEARED_8
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".resetcause")
	#undef MEMMAP_ERROR
#endif
#ifdef RESETCAUSE_STOP_SEC_VAR_POWER_ON_CLEARED_8
	#undef RESETCAUSE_STOP_SEC_VAR_POWER_ON_CLEARED_8
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  ResetCause END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Return START
**********************************************************************************************************************/

#ifdef RETURN_START_SEC_VAR_CLEARED_32
	#undef RETURN_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef RETURN_STOP_SEC_VAR_CLEARED_32
	#undef RETURN_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef RETURN_START_SEC_VAR_CLEARED_16
	#undef RETURN_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef RETURN_STOP_SEC_VAR_CLEARED_16
	#undef RETURN_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  Return END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  ReturnFirewall START
**********************************************************************************************************************/

#ifdef RETURNFIREWALL_START_SEC_VAR_CLEARED_32
	#undef RETURNFIREWALL_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef RETURNFIREWALL_STOP_SEC_VAR_CLEARED_32
	#undef RETURNFIREWALL_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

