sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef RETURNFIREWALL_START_SEC_VAR_CLEARED_BOOLEAN
	#undef RETURNFIREWALL_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef RETURNFIREWALL_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef RETURNFIREWALL_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  ReturnFirewall END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  ShtdnMech START
**********************************************************************************************************************/

#ifdef SHTDNMECH_START_SEC_VAR_CLEARED_32
	#undef SHTDNMECH_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef SHTDNMECH_STOP_SEC_VAR_CLEARED_32
	#undef SHTDNMECH_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef SHTDNMECH_START_SEC_VAR_CLEARED_8
	#undef SHTDNMECH_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef SHTDNMECH_STOP_SEC_VAR_CLEARED_8
	#undef SHTDNMECH_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  ShtdnMech END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  SignlCondn START
**********************************************************************************************************************/

#ifdef SIGNLCONDN_START_SEC_VAR_NOINIT_32
	#undef SIGNLCONDN_START_SEC_VAR_NOINIT_32
	#define START_SEC_VAR_NOINIT_32BIT_11
#endif
#ifdef SIGNLCONDN_STOP_SEC_VAR_NOINIT_32
	#undef SIGNLCONDN_STOP_SEC_VAR_NOINIT_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  SignlCondn END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  SpiNxt START
**********************************************************************************************************************/

#ifdef SPINXT_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef SPINXT_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_0
#endif
#ifdef SPINXT_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef SPINXT_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef SPINXT_START_SEC_CODE
	#undef SPINXT_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef SPINXT_STOP_SEC_CODE
	#undef SPINXT_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

/**********************************************************************************************************************
*  SpiNxt END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  SrlComDriver START
**********************************************************************************************************************/

#ifdef SRLCOMDRIVER_START_SEC_VAR_CLEARED_32
	#undef SRLCOMDRIVER_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_6
#endif
#ifdef SRLCOMDRIVER_STOP_SEC_VAR_CLEARED_32
	#undef SRLCOMDRIVER_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef SRLCOMDRIVER_START_SEC_VAR_CLEARED_16
	#undef SRLCOMDRIVER_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_6
#endif
#ifdef SRLCOMDRIVER_STOP_SEC_VAR_CLEARED_16
	#undef SRLCOMDRIVER_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef SRLCOMDRIVER_START_SEC_VAR_CLEARED_8
	#undef SRLCOMDRIVER_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_6
#endif
#ifdef SRLCOMDRIVER_STOP_SEC_VAR_CLEARED_8
	#undef SRLCOMDRIVER_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef SRLCOMDRIVER_START_SEC_VAR_CLEARED_BOOLEAN
	#undef SRLCOMDRIVER_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef SRLCOMDRIVER_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef SRLCOMDRIVER_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef SRLCOMDRIVER_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef SRLCOMDRIVER_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef SRLCOMDRIVER_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef SRLCOMDRIVER_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  SrlComDriver END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  SrlComInput START
**********************************************************************************************************************/

#ifdef SRLCOMINPUT_START_SEC_VAR_CLEARED_32
	#undef SRLCOMINPUT_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef SRLCOMINPUT_STOP_SEC_VAR_CLEARED_32
	#undef SRLCOMINPUT_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef SRLCOMINPUT_START_SEC_VAR_CLEARED_16
	#undef SRLCOMINPUT_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef SRLCOMINPUT_STOP_SEC_VAR_CLEARED_16
	#undef SRLCOMINPUT_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef SRLCOMINPUT_START_SEC_VAR_CLEARED_8
	#undef SRLCOMINPUT_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef SRLCOMINPUT_STOP_SEC_VAR_CLEARED_8
	#undef SRLCOMINPUT_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef SRLCOMINPUT_START_SEC_VAR_CLEARED_BOOLEAN
	#undef SRLCOMINPUT_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef SRLCOMINPUT_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef SRLCOMINPUT_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  SrlComInput END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  SrlComOutput START
**********************************************************************************************************************/

