sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef SRLCOMOUTPUT_START_SEC_VAR_CLEARED_UNDEFINED
	#undef SRLCOMOUTPUT_START_SEC_VAR_CLEARED_UNDEFINED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef SRLCOMOUTPUT_STOP_SEC_VAR_CLEARED_UNDEFINED
	#undef SRLCOMOUTPUT_STOP_SEC_VAR_CLEARED_UNDEFINED
	#define STOP_SEC_VAR
#endif

#ifdef SRLCOMOUTPUT_START_SEC_VAR_CLEARED_32
	#undef SRLCOMOUTPUT_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef SRLCOMOUTPUT_STOP_SEC_VAR_CLEARED_32
	#undef SRLCOMOUTPUT_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef SRLCOMOUTPUT_START_SEC_VAR_CLEARED_BOOLEAN
	#undef SRLCOMOUTPUT_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef SRLCOMOUTPUT_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef SRLCOMOUTPUT_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  SrlComOutput END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  StabilityComp START
**********************************************************************************************************************/

#ifdef STABILITYCOMP_START_SEC_VAR_CLEARED_32
	#undef STABILITYCOMP_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef STABILITYCOMP_STOP_SEC_VAR_CLEARED_32
	#undef STABILITYCOMP_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef STABILITYCOMP_START_SEC_VAR_CLEARED_16
	#undef STABILITYCOMP_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef STABILITYCOMP_STOP_SEC_VAR_CLEARED_16
	#undef STABILITYCOMP_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef STABILITYCOMP_START_SEC_VAR_CLEARED_BOOLEAN
	#undef STABILITYCOMP_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef STABILITYCOMP_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef STABILITYCOMP_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef STABILITYCOMP_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef STABILITYCOMP_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef STABILITYCOMP_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef STABILITYCOMP_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  StabilityComp END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  StabilityComp2 START
**********************************************************************************************************************/

#ifdef STABILITYCOMP2_START_SEC_VAR_CLEARED_32
	#undef STABILITYCOMP2_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_11
#endif
#ifdef STABILITYCOMP2_STOP_SEC_VAR_CLEARED_32
	#undef STABILITYCOMP2_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef STABILITYCOMP2_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef STABILITYCOMP2_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_11
#endif
#ifdef STABILITYCOMP2_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef STABILITYCOMP2_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  StabilityComp2 END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  StaMd START
**********************************************************************************************************************/

#ifdef STAMD_START_SEC_CONST_UNSPECIFIED
	#undef STAMD_START_SEC_CONST_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif
#ifdef STAMD_STOP_SEC_CONST_UNSPECIFIED
	#undef STAMD_STOP_SEC_CONST_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif

#ifdef STAMD_START_SEC_VAR_SAVED_ZONEHGS_8
	#undef STAMD_START_SEC_VAR_SAVED_ZONEHGS_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_GLOBALSHARED
#endif
#ifdef STAMD_STOP_SEC_VAR_SAVED_ZONEHGS_8
	#undef STAMD_STOP_SEC_VAR_SAVED_ZONEHGS_8
	#define STOP_SEC_VAR
#endif

#ifdef STAMD_START_SEC_VAR_SAVED_ZONEHGS_32
	#undef STAMD_START_SEC_VAR_SAVED_ZONEHGS_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_GLOBALSHARED
#endif
#ifdef STAMD_STOP_SEC_VAR_SAVED_ZONEHGS_32
	#undef STAMD_STOP_SEC_VAR_SAVED_ZONEHGS_32
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  StaMd END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  StaMd6 START
**********************************************************************************************************************/

#ifdef STAMD6_START_SEC_VAR_INIT_UNSPECIFIED
	#undef STAMD6_START_SEC_VAR_INIT_UNSPECIFIED
	#define START_SEC_VAR_INIT_UNSPECIFIED_6
#endif
#ifdef STAMD6_STOP_SEC_VAR_INIT_UNSPECIFIED
	#undef STAMD6_STOP_SEC_VAR_INIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef STAMD6_START_SEC_VAR_CLEARED_BOOLEAN
	#undef STAMD6_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_INIT_UNSPECIFIED_6
#endif
#ifdef STAMD6_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef STAMD6_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef STAMD6_START_SEC_VAR_CLEARED_32
	#undef STAMD6_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_6
#endif
#ifdef STAMD6_STOP_SEC_VAR_CLEARED_32
	#undef STAMD6_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef STAMD6_START_SEC_VAR_CLEARED_16
	#undef STAMD6_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_6
#endif
#ifdef STAMD6_STOP_SEC_VAR_CLEARED_16
	#undef STAMD6_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  StaMd6 END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  StaMd9 START
**********************************************************************************************************************/

