sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef STAMD9_START_SEC_VAR_INIT_UNSPECIFIED
	#undef STAMD9_START_SEC_VAR_INIT_UNSPECIFIED
	#define START_SEC_VAR_INIT_UNSPECIFIED_9
#endif
#ifdef STAMD9_STOP_SEC_VAR_INIT_UNSPECIFIED
	#undef STAMD9_STOP_SEC_VAR_INIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef STAMD9_START_SEC_VAR_CLEARED_32
	#undef STAMD9_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef STAMD9_STOP_SEC_VAR_CLEARED_32
	#undef STAMD9_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef STAMD9_START_SEC_VAR_CLEARED_BOOLEAN
	#undef STAMD9_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef STAMD9_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef STAMD9_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  StaMd9 END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  StaMd10 START
**********************************************************************************************************************/

#ifdef STAMD10_START_SEC_VAR_INIT_UNSPECIFIED
	#undef STAMD10_START_SEC_VAR_INIT_UNSPECIFIED
	#define START_SEC_VAR_INIT_UNSPECIFIED_10
#endif
#ifdef STAMD10_STOP_SEC_VAR_INIT_UNSPECIFIED
	#undef STAMD10_STOP_SEC_VAR_INIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef STAMD10_START_SEC_VAR_CLEARED_32
	#undef STAMD10_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef STAMD10_STOP_SEC_VAR_CLEARED_32
	#undef STAMD10_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef STAMD10_START_SEC_VAR_CLEARED_8
	#undef STAMD10_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef STAMD10_STOP_SEC_VAR_CLEARED_8
	#undef STAMD10_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef STAMD10_START_SEC_VAR_CLEARED_BOOLEAN
	#undef STAMD10_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef STAMD10_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef STAMD10_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  StaMd10 END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  StaMd11 START
**********************************************************************************************************************/

#ifdef STAMD11_START_SEC_VAR_INIT_UNSPECIFIED
	#undef STAMD11_START_SEC_VAR_INIT_UNSPECIFIED
	#define START_SEC_VAR_INIT_UNSPECIFIED_11
#endif
#ifdef STAMD11_STOP_SEC_VAR_INIT_UNSPECIFIED
	#undef STAMD11_STOP_SEC_VAR_INIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef STAMD11_START_SEC_VAR_CLEARED_32
	#undef STAMD11_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_11
#endif
#ifdef STAMD11_STOP_SEC_VAR_CLEARED_32
	#undef STAMD11_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef STAMD11_START_SEC_VAR_CLEARED_16
	#undef STAMD11_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_11
#endif
#ifdef STAMD11_STOP_SEC_VAR_CLEARED_16
	#undef STAMD11_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  StaMd8 END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  StOpCtrl START
**********************************************************************************************************************/

#ifdef STOPCTRL_START_SEC_VAR_CLEARED_32
	#undef STOPCTRL_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef STOPCTRL_STOP_SEC_VAR_CLEARED_32
	#undef STOPCTRL_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef STOPCTRL_START_SEC_VAR_INIT_08
	#undef STOPCTRL_START_SEC_VAR_INIT_08
	#define START_SEC_VAR_INIT_8BIT_10
#endif
#ifdef STOPCTRL_STOP_SEC_VAR_INIT_08
	#undef STOPCTRL_STOP_SEC_VAR_INIT_08
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  StOpCtrl END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Sweep START
**********************************************************************************************************************/

#ifdef SWEEP_START_SEC_VAR_CLEARED_32
	#undef SWEEP_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_GLOBALSHARED
#endif
#ifdef SWEEP_STOP_SEC_VAR_CLEARED_32
	#undef SWEEP_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef SWEEP_START_SEC_VAR_CLEARED_16
	#undef SWEEP_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_GLOBALSHARED
#endif
#ifdef SWEEP_STOP_SEC_VAR_CLEARED_16
	#undef SWEEP_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef SWEEP_START_SEC_VAR_CLEARED_BOOLEAN
	#undef SWEEP_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_GLOBALSHARED
#endif
#ifdef SWEEP_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef SWEEP_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  Sweep END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  ThrmlDutyCycle START
**********************************************************************************************************************/

#ifdef THRMLDUTYCYCLE_START_SEC_VAR_CLEARED_8
	#undef THRMLDUTYCYCLE_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_9
#endif
#ifdef THRMLDUTYCYCLE_STOP_SEC_VAR_CLEARED_8
	#undef THRMLDUTYCYCLE_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

