sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef THRMLDUTYCYCLE_START_SEC_VAR_CLEARED_16
	#undef THRMLDUTYCYCLE_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef THRMLDUTYCYCLE_STOP_SEC_VAR_CLEARED_16
	#undef THRMLDUTYCYCLE_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef THRMLDUTYCYCLE_START_SEC_VAR_CLEARED_32
	#undef THRMLDUTYCYCLE_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef THRMLDUTYCYCLE_STOP_SEC_VAR_CLEARED_32
	#undef THRMLDUTYCYCLE_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef THRMLDUTYCYCLE_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef THRMLDUTYCYCLE_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef THRMLDUTYCYCLE_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef THRMLDUTYCYCLE_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef THRMLDUTYCYCLE_STARTP_SEC_VAR_CLEARED_BOOLEAN
	#undef THRMLDUTYCYCLE_STARTP_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef THRMLDUTYCYCLE_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef THRMLDUTYCYCLE_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  ThrmlDutyCycle END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  TmprlMon START
**********************************************************************************************************************/

#ifdef TMPRLMON_START_SEC_CONST_UNSPECIFIED
	#undef TMPRLMON_START_SEC_CONST_UNSPECIFIED
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef TMPRLMON_STOP_SEC_CONST_UNSPECIFIED
	#undef TMPRLMON_STOP_SEC_CONST_UNSPECIFIED
	#define STOP_SEC_CONST
#endif

#ifdef TMPRLMON_START_SEC_VAR_CLEARED_8
	#undef TMPRLMON_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_9
#endif
#ifdef TMPRLMON_STOP_SEC_VAR_CLEARED_8
	#undef TMPRLMON_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef TMPRLMON_START_SEC_VAR_CLEARED_32
	#undef TMPRLMON_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef TMPRLMON_STOP_SEC_VAR_CLEARED_32
	#undef TMPRLMON_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef TMPRLMON_START_SEC_VAR_CLEARED_16
	#undef TMPRLMON_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef TMPRLMON_STOP_SEC_VAR_CLEARED_16
	#undef TMPRLMON_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef TMPRLMON_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef TMPRLMON_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef TMPRLMON_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef TMPRLMON_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef TMPRLMON_START_SEC_VAR_CLEARED_BOOLEAN
	#undef TMPRLMON_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_8BIT_9
#endif
#ifdef TMPRLMON_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef TMPRLMON_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  TmprlMon END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  TRANLDAMPG START
**********************************************************************************************************************/

#ifdef TRANLDAMPG_START_SEC_VAR_CLEARED_08
	#undef TRANLDAMPG_START_SEC_VAR_CLEARED_08
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef TRANLDAMPG_STOP_SEC_VAR_CLEARED_08
	#undef TRANLDAMPG_STOP_SEC_VAR_CLEARED_08
	#define STOP_SEC_VAR
#endif

#ifdef TRANLDAMPG_START_SEC_VAR_CLEARED_32
	#undef TRANLDAMPG_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef TRANLDAMPG_STOP_SEC_VAR_CLEARED_32
	#undef TRANLDAMPG_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef TRANLDAMPG_START_SEC_VAR_CLEARED_16
	#undef TRANLDAMPG_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef TRANLDAMPG_STOP_SEC_VAR_CLEARED_16
	#undef TRANLDAMPG_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef TRANLDAMPG_START_SEC_VAR_CLEARED_BOOLEAN
	#undef TRANLDAMPG_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_8BIT_10
#endif
#ifdef TRANLDAMPG_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef TRANLDAMPG_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef TRANLDAMPG_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef TRANLDAMPG_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef TRANLDAMPG_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef TRANLDAMPG_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  TRANLDAMPG END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  TrqCanc START
**********************************************************************************************************************/

#ifdef TRQCANC_START_SEC_VAR_CLEARED_16
	#undef TRQCANC_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef TRQCANC_STOP_SEC_VAR_CLEARED_16
	#undef TRQCANC_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef TRQCANC_START_SEC_VAR_CLEARED_32
	#undef TRQCANC_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef TRQCANC_STOP_SEC_VAR_CLEARED_32
	#undef TRQCANC_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef TRQCANC_START_SEC_CONST_16
	#undef TRQCANC_START_SEC_CONST_16
	#define START_SEC_CONST_16BIT
#endif
#ifdef TRQCANC_STOP_SEC_CONST_16
	#undef TRQCANC_STOP_SEC_CONST_16
	#define STOP_SEC_CONST
#endif

/**********************************************************************************************************************
*  TrqCanc END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  TrqLOA START
**********************************************************************************************************************/

#ifdef TRQLOA_START_SEC_VAR_CLEARED_32
	#undef TRQLOA_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef TRQLOA_STOP_SEC_VAR_CLEARED_32
	#undef TRQLOA_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef TRQLOA_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef TRQLOA_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef TRQLOA_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef TRQLOA_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef TRQLOA_START_SEC_VAR_CLEARED_BOOLEAN
	#undef TRQLOA_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef TRQLOA_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef TRQLOA_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  TrqLOA END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  TqRsDg START
**********************************************************************************************************************/

