sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef TQRSDG_START_SEC_VAR_CLEARED_32
	#undef TQRSDG_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef TQRSDG_STOP_SEC_VAR_CLEARED_32
	#undef TQRSDG_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef TQRSDG_START_SEC_VAR_CLEARED_16
	#undef TQRSDG_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef TQRSDG_STOP_SEC_VAR_CLEARED_16
	#undef TQRSDG_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef TQRSDG_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef TQRSDG_START_SEC_VAR_NOINIT_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_10
#endif
#ifdef TQRSDG_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef TQRSDG_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  TqRsDg END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  TuningSelAuth START
**********************************************************************************************************************/

#ifdef TUNINGSELAUTH_START_SEC_VAR_CLEARED_16
	#undef TUNINGSELAUTH_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_11
#endif
#ifdef TUNINGSELAUTH_STOP_SEC_VAR_CLEARED_16
	#undef TUNINGSELAUTH_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef TUNINGSELAUTH_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef TUNINGSELAUTH_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_11
#endif
#ifdef TUNINGSELAUTH_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef TUNINGSELAUTH_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  TuningSelAuth END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  uDiag START
**********************************************************************************************************************/

#ifdef STARTUP_START_SEC_VAR_NOINIT_32
	#undef STARTUP_START_SEC_VAR_NOINIT_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_0
#endif
#ifdef STARTUP_STOP_SEC_VAR_NOINIT_32
	#undef STARTUP_STOP_SEC_VAR_NOINIT_32
	#define STOP_SEC_VAR
#endif

#ifdef STARTUP_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef STARTUP_START_SEC_VAR_NOINIT_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_0
#endif
#ifdef STARTUP_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef STARTUP_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef WDGRESETHANDLER_START_SEC_VAR_POWER_ON_CLEARED_8
	#undef WDGRESETHANDLER_START_SEC_VAR_POWER_ON_CLEARED_8
	#define START_SEC_VAR_POWER_ON_CLEARED_UNSPECIFIED
#endif
#ifdef WDGRESETHANDLER_STOP_SEC_VAR_POWER_ON_CLEARED_8
	#undef WDGRESETHANDLER_STOP_SEC_VAR_POWER_ON_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef UDIAG_START_SEC_CONST_UNSPECIFIED
	#undef MEMMAP_ERROR
	#undef UDIAG_START_SEC_CONST_UNSPECIFIED
#endif
#ifdef UDIAG_STOP_SEC_CONST_UNSPECIFIED
	#undef MEMMAP_ERROR
	#undef UDIAG_STOP_SEC_CONST_UNSPECIFIED
#endif

#ifdef UDIAG_START_SEC_VAR_CLEARED_BOOLEAN
	#undef UDIAG_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef UDIAG_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef UDIAG_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef UDIAG_START_SEC_VAR_CLEARED_16
	#undef UDIAG_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_10
#endif
#ifdef UDIAG_STOP_SEC_VAR_CLEARED_16
	#undef UDIAG_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

#ifdef UDIAG_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef UDIAG_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
#endif
#ifdef UDIAG_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef UDIAG_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef UDIAG_START_SEC_VAR_CLEARED_32
	#undef UDIAG_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_10
#endif
#ifdef UDIAG_STOP_SEC_VAR_CLEARED_32
	#undef UDIAG_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef UDIAG_START_SEC_VAR_SAVED_UNSPECIFIED
	#undef UDIAG_START_SEC_VAR_SAVED_UNSPECIFIED
	#define START_SEC_VAR_POWER_ON_CLEARED_UNSPECIFIED
#endif
#ifdef UDIAG_STOP_SEC_VAR_SAVED_UNSPECIFIED
	#undef UDIAG_STOP_SEC_VAR_SAVED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  uDiag END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  VehDyn START
**********************************************************************************************************************/

#ifdef VEHDYN_START_SEC_VAR_CLEARED_32
	#undef VEHDYN_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef VEHDYN_STOP_SEC_VAR_CLEARED_32
	#undef VEHDYN_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef VEHDYN_START_SEC_VAR_CLEARED_UNSPECIFIED
	#undef VEHDYN_START_SEC_VAR_CLEARED_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef VEHDYN_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#undef VEHDYN_STOP_SEC_VAR_CLEARED_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef VEHDYN_START_SEC_VAR_CLEARED_BOOLEAN
	#undef VEHDYN_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef VEHDYN_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef VEHDYN_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

#ifdef VEHDYN_START_SEC_VAR_CLEARED_8
	#undef VEHDYN_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_8BIT_9
#endif

#ifdef VEHDYN_STOP_SEC_VAR_CLEARED_8
	#undef VEHDYN_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif




/**********************************************************************************************************************
*  VehDyn END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  VehPwrMd START
**********************************************************************************************************************/

#ifdef VEHPWRMD_START_SEC_VAR_CLEARED_32
	#undef VEHPWRMD_START_SEC_VAR_CLEARED_32
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef VEHPWRMD_STOP_SEC_VAR_CLEARED_32
	#undef VEHPWRMD_STOP_SEC_VAR_CLEARED_32
	#define STOP_SEC_VAR
#endif

#ifdef VEHPWRMD_START_SEC_VAR_CLEARED_8
	#undef VEHPWRMD_START_SEC_VAR_CLEARED_8
	#define START_SEC_VAR_ZERO_INIT_32BIT_9
#endif
#ifdef VEHPWRMD_STOP_SEC_VAR_CLEARED_8
	#undef VEHPWRMD_STOP_SEC_VAR_CLEARED_8
	#define STOP_SEC_VAR
#endif

#ifdef VEHPWRMD_START_SEC_VAR_CLEARED_BOOLEAN
	#undef VEHPWRMD_START_SEC_VAR_CLEARED_BOOLEAN
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
#endif
#ifdef VEHPWRMD_STOP_SEC_VAR_CLEARED_BOOLEAN
	#undef VEHPWRMD_STOP_SEC_VAR_CLEARED_BOOLEAN
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  VehPwrMd END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  VehSpdLmt START
**********************************************************************************************************************/

#ifdef VEHSPDLMT_START_SEC_VAR_CLEARED_16
	#undef VEHSPDLMT_START_SEC_VAR_CLEARED_16
	#define START_SEC_VAR_ZERO_INIT_16BIT_9
#endif
#ifdef VEHSPDLMT_STOP_SEC_VAR_CLEARED_16
	#undef VEHSPDLMT_STOP_SEC_VAR_CLEARED_16
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  VehSpdLmt END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Xcp START
**********************************************************************************************************************/

#ifdef XCP_START_SEC_CODE
	#undef XCP_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef XCP_STOP_SEC_CODE
	#undef XCP_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

