sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef XCP_START_SEC_CONST_UNSPECIFIED
	#undef XCP_START_SEC_CONST_UNSPECIFIED
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef XCP_STOP_SEC_CONST_UNSPECIFIED
	#undef XCP_STOP_SEC_CONST_UNSPECIFIED
	#define STOP_SEC_CONST
#endif

#ifdef XCP_START_SEC_CONST_16BIT
	#undef XCP_START_SEC_CONST_16BIT
	#define START_SEC_CONST_16BIT
#endif
#ifdef XCP_STOP_SEC_CONST_16BIT
	#undef XCP_STOP_SEC_CONST_16BIT
	#define STOP_SEC_CONST
#endif

#ifdef XCP_START_SEC_CONST_8BIT
	#undef XCP_START_SEC_CONST_8BIT
	#define START_SEC_CONST_8BIT
#endif
#ifdef XCP_STOP_SEC_CONST_8BIT
	#undef XCP_STOP_SEC_CONST_8BIT
	#define STOP_SEC_CONST
#endif

#ifdef XCP_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef XCP_START_SEC_VAR_NOINIT_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_6
#endif
#ifdef XCP_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef XCP_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef XCP_START_SEC_VAR_NOINIT_8BIT
	#undef XCP_START_SEC_VAR_NOINIT_8BIT
	#define START_SEC_VAR_NOINIT_8BIT_6
#endif
#ifdef XCP_STOP_SEC_VAR_NOINIT_8BIT
	#undef XCP_STOP_SEC_VAR_NOINIT_8BIT
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  Xcp END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  CanXcp START
**********************************************************************************************************************/

#ifdef CANXCP_START_SEC_CODE
	#undef CANXCP_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef CANXCP_STOP_SEC_CODE
	#undef CANXCP_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef CANXCP_START_SEC_CONST_8BIT
	#undef CANXCP_START_SEC_CONST_8BIT
	#define START_SEC_CONST_8BIT
#endif
#ifdef CANXCP_STOP_SEC_CONST_8BIT
	#undef CANXCP_STOP_SEC_CONST_8BIT
	#define STOP_SEC_CONST
#endif

#ifdef CANXCP_START_SEC_PBCFG_ROOT
	#undef CANXCP_START_SEC_PBCFG_ROOT
	#define START_SEC_CONST_PBCFG
#endif
#ifdef CANXCP_STOP_SEC_PBCFG_ROOT
	#undef CANXCP_STOP_SEC_PBCFG_ROOT
	#define STOP_SEC_CONST
#endif

#ifdef CANXCP_START_SEC_PBCFG
	#undef CANXCP_START_SEC_PBCFG
	#define START_SEC_CONST_PBCFG
#endif
#ifdef CANXCP_STOP_SEC_PBCFG
	#undef CANXCP_STOP_SEC_PBCFG
	#define STOP_SEC_CONST
#endif

#ifdef CANXCP_START_SEC_VAR_NOINIT_8BIT
	#undef CANXCP_START_SEC_VAR_NOINIT_8BIT
	#define START_SEC_VAR_NOINIT_8BIT_6
#endif
#ifdef CANXCP_STOP_SEC_VAR_NOINIT_8BIT
	#undef CANXCP_STOP_SEC_VAR_NOINIT_8BIT
	#define STOP_SEC_VAR
#endif

#ifdef CANXCP_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef CANXCP_START_SEC_VAR_NOINIT_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_6
#endif
#ifdef CANXCP_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef CANXCP_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  CanXcp END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Dio START
**********************************************************************************************************************/

#ifdef DIO_START_SEC_CODE
	#undef DIO_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef DIO_STOP_SEC_CODE
	#undef DIO_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef DIO_START_SEC_CONST_UNSPECIFIED
	#undef DIO_START_SEC_CONST_UNSPECIFIED
	#define START_SEC_CONST_32BIT
#endif
#ifdef DIO_STOP_SEC_CONST_UNSPECIFIED
	#undef DIO_STOP_SEC_CONST_UNSPECIFIED
	#define STOP_SEC_CONST
#endif

/**********************************************************************************************************************
*  Dio END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Fee START
**********************************************************************************************************************/

#ifdef FEE_START_SEC_CODE
	#undef FEE_START_SEC_CODE
	#define START_SEC_CODE
	/* open var section for function-level static variables */
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef FEE_STOP_SEC_CODE
	#undef FEE_STOP_SEC_CODE
	#define STOP_SEC_CODE
	#define STOP_SEC_VAR
#endif

#ifdef FEE_START_SEC_CONST_UNSPECIFIED
	#undef FEE_START_SEC_CONST_UNSPECIFIED
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef FEE_STOP_SEC_CONST_UNSPECIFIED
	#undef FEE_STOP_SEC_CONST_UNSPECIFIED
	#define STOP_SEC_CONST
#endif

#ifdef FEE_START_SEC_VAR_INIT_UNSPECIFIED
	#undef FEE_START_SEC_VAR_INIT_UNSPECIFIED
	#define START_SEC_VAR_INIT_UNSPECIFIED_6
#endif
#ifdef FEE_STOP_SEC_VAR_INIT_UNSPECIFIED
	#undef FEE_STOP_SEC_VAR_INIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  Fee END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Gpt START
**********************************************************************************************************************/

#ifdef GPT_START_SEC_CODE
	#undef GPT_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef GPT_STOP_SEC_CODE
	#undef GPT_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef GPT_START_SEC_CODE_ISR
	#undef GPT_START_SEC_CODE_ISR
	#define START_SEC_CODE_ISR
#endif
#ifdef GPT_STOP_SEC_CODE_ISR
	#undef GPT_STOP_SEC_CODE_ISR
	#define STOP_SEC_CODE
#endif

#ifdef GPT_START_SEC_PBCFG_ROOT
	#undef GPT_START_SEC_PBCFG_ROOT
	#define START_SEC_CONST_PBCFG
#endif
#ifdef GPT_STOP_SEC_PBCFG_ROOT
	#undef GPT_STOP_SEC_PBCFG_ROOT
	#define STOP_SEC_CONST
#endif

#ifdef GPT_START_SEC_PBCFG
	#undef GPT_START_SEC_PBCFG
	#define START_SEC_CONST_PBCFG
#endif
#ifdef GPT_STOP_SEC_PBCFG
	#undef GPT_STOP_SEC_PBCFG
	#define STOP_SEC_CONST
#endif

