sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef GPT_START_SEC_CONST_32BIT
	#undef GPT_START_SEC_CONST_32BIT
	#define START_SEC_CONST_32BIT
#endif
#ifdef GPT_STOP_SEC_CONST_32BIT
	#undef GPT_STOP_SEC_CONST_32BIT
	#define STOP_SEC_CONST
#endif

#ifdef GPT_START_SEC_VAR_32BIT
	#undef GPT_START_SEC_VAR_32BIT
	#define START_SEC_VAR_NOINIT_32BIT_6
#endif
#ifdef GPT_STOP_SEC_VAR_32BIT
	#undef GPT_STOP_SEC_VAR_32BIT
	#define STOP_SEC_VAR
#endif

#ifdef GPT_START_SEC_VAR_INIT_UNSPECIFIED
	#undef GPT_START_SEC_VAR_INIT_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_6
#endif
#ifdef GPT_STOP_SEC_VAR_INIT_UNSPECIFIED
	#undef GPT_STOP_SEC_VAR_INIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef GPT_START_SEC_VAR_UNSPECIFIED
	#undef GPT_START_SEC_VAR_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_6
#endif
#ifdef GPT_STOP_SEC_VAR_UNSPECIFIED
	#undef GPT_STOP_SEC_VAR_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  Gpt END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Mcu START
**********************************************************************************************************************/

#ifdef MCU_START_SEC_CODE
	#undef MCU_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef MCU_STOP_SEC_CODE
	#undef MCU_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef MCU_START_SEC_PBCFG
	#undef MCU_START_SEC_PBCFG
	#define START_SEC_CONST_PBCFG
#endif
#ifdef MCU_STOP_SEC_PBCFG
	#undef MCU_STOP_SEC_PBCFG
	#define STOP_SEC_CONST
#endif

#ifdef MCU_START_SEC_PBCFG_ROOT
	#undef MCU_START_SEC_PBCFG_ROOT
	#define START_SEC_CONST_PBCFG
#endif
#ifdef MCU_STOP_SEC_PBCFG_ROOT
	#undef MCU_STOP_SEC_PBCFG_ROOT
	#define STOP_SEC_CONST
#endif

#ifdef MCU_START_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#undef MCU_START_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef MCU_STOP_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#undef MCU_STOP_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  Mcu END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Port START
**********************************************************************************************************************/

#ifdef PORT_START_SEC_CODE
	#undef PORT_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef PORT_STOP_SEC_CODE
	#undef PORT_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef PORT_START_SEC_PBCODE
	#undef PORT_START_SEC_PBCODE
	#define START_SEC_CODE
#endif
#ifdef PORT_STOP_SEC_PBCODE
	#undef PORT_STOP_SEC_PBCODE
	#define STOP_SEC_CODE
#endif

#ifdef PORT_START_SEC_PBCFG
	#undef PORT_START_SEC_PBCFG
	#define START_SEC_CONST_PBCFG
#endif
#ifdef PORT_STOP_SEC_PBCFG
	#undef PORT_STOP_SEC_PBCFG
	#define STOP_SEC_CONST
#endif

#ifdef PORT_START_SEC_PBCFG_ROOT
	#undef PORT_START_SEC_PBCFG_ROOT
	#define START_SEC_CONST_PBCFG
#endif
#ifdef PORT_STOP_SEC_PBCFG_ROOT
	#undef PORT_STOP_SEC_PBCFG_ROOT
	#define STOP_SEC_CONST
#endif

#ifdef PORT_START_SEC_VAR_UNSPECIFIED
	#undef PORT_START_SEC_VAR_UNSPECIFIED
	#define START_SEC_VAR_INIT_UNSPECIFIED_6
#endif
#ifdef PORT_STOP_SEC_VAR_UNSPECIFIED
	#undef PORT_STOP_SEC_VAR_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  Port END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Wdg START
**********************************************************************************************************************/

#ifdef WDG_START_SEC_CODE
	#undef WDG_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef WDG_STOP_SEC_CODE
	#undef WDG_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef WDG_START_SEC_CONST_8BIT
	#undef WDG_START_SEC_CONST_8BIT
	#define START_SEC_CONST_8BIT
#endif
#ifdef WDG_STOP_SEC_CONST_8BIT
	#undef WDG_STOP_SEC_CONST_8BIT
	#define STOP_SEC_CONST
#endif

#ifdef WDG_START_SEC_CONST_16BIT
	#undef WDG_START_SEC_CONST_16BIT
	#define START_SEC_CONST_16BIT
#endif
#ifdef WDG_STOP_SEC_CONST_16BIT
	#undef WDG_STOP_SEC_CONST_16BIT
	#define STOP_SEC_CONST
#endif

#ifdef WDG_START_SEC_CONST_32BIT
	#undef WDG_START_SEC_CONST_32BIT
	#define START_SEC_CONST_32BIT
#endif
#ifdef WDG_STOP_SEC_CONST_32BIT
	#undef WDG_STOP_SEC_CONST_32BIT
	#define STOP_SEC_CONST
#endif

#ifdef WDG_START_SEC_CONST_UNSPECIFIED
	#undef WDG_START_SEC_CONST_UNSPECIFIED
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef WDG_STOP_SEC_CONST_UNSPECIFIED
	#undef WDG_STOP_SEC_CONST_UNSPECIFIED
	#define STOP_SEC_CONST
#endif

#ifdef WDG_START_SEC_VAR_8BIT
	#undef WDG_START_SEC_VAR_8BIT
	#define START_SEC_VAR_INIT_8BIT_0
#endif
#ifdef WDG_STOP_SEC_VAR_8BIT
	#undef WDG_STOP_SEC_VAR_8BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDG_START_SEC_VAR_16BIT
	#undef WDG_START_SEC_VAR_16BIT
	#define START_SEC_VAR_INIT_16BIT_0
#endif
#ifdef WDG_STOP_SEC_VAR_16BIT
	#undef WDG_STOP_SEC_VAR_16BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDG_START_SEC_VAR_32BIT
	#undef WDG_START_SEC_VAR_32BIT
	#define START_SEC_VAR_INIT_32BIT_0
#endif
#ifdef WDG_STOP_SEC_VAR_32BIT
	#undef WDG_STOP_SEC_VAR_32BIT
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  Wdg END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  IoHwAb START
**********************************************************************************************************************/

#ifdef IOHWAB_START_SEC_CODE
	#undef IOHWAB_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef IOHWAB_STOP_SEC_CODE
	#undef IOHWAB_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef IOHWAB_START_SEC_CONST_32BIT
	#undef IOHWAB_START_SEC_CONST_32BIT
	#define START_SEC_CONST_32BIT
#endif
#ifdef IOHWAB_STOP_SEC_CONST_32BIT
	#undef IOHWAB_STOP_SEC_CONST_32BIT
	#define STOP_SEC_CONST
#endif

#ifdef IOHWAB_START_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#undef IOHWAB_START_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef IOHWAB_STOP_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#undef IOHWAB_STOP_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  IoHwAb END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  MemIf START
**********************************************************************************************************************/

#ifdef MEMIF_START_SEC_CONST_8BIT
	#undef MEMIF_START_SEC_CONST_8BIT
	#define START_SEC_CONST_8BIT
#endif
#ifdef MEMIF_STOP_SEC_CONST_8BIT
	#undef MEMIF_STOP_SEC_CONST_8BIT
	#define STOP_SEC_CONST
#endif

#ifdef MEMIF_START_SEC_CONST_32BIT
	#undef MEMIF_START_SEC_CONST_32BIT
	#define START_SEC_CONST_32BIT
#endif
#ifdef MEMIF_STOP_SEC_CONST_32BIT
	#undef MEMIF_STOP_SEC_CONST_32BIT
	#define STOP_SEC_CONST
#endif

