sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef MEMIF_START_SEC_CODE
	#undef MEMIF_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef MEMIF_STOP_SEC_CODE
	#undef MEMIF_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

/**********************************************************************************************************************
*  MemIf END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  WdgIf START
**********************************************************************************************************************/

#ifdef WDGIF_START_SEC_CODE
	#undef WDGIF_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef WDGIF_STOP_SEC_CODE
	#undef WDGIF_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#if defined WDGIF_START_SEC_VAR_INIT_8BIT
	#undef WDGIF_START_SEC_VAR_INIT_8BIT
	#define START_SEC_VAR_INIT_8BIT_6
#endif
#ifdef WDGIF_STOP_SEC_VAR_INIT_8BIT
	#undef WDGIF_STOP_SEC_VAR_INIT_8BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGIF_START_SEC_VAR_INIT_16BIT
	#undef WDGIF_START_SEC_VAR_INIT_16BIT
	#define START_SEC_VAR_INIT_16BIT_6
#endif
#ifdef WDGIF_STOP_SEC_VAR_INIT_16BIT
	#undef WDGIF_STOP_SEC_VAR_INIT_16BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGIF_START_SEC_VAR_INIT_32BIT
	#undef WDGIF_START_SEC_VAR_INIT_32BIT
	#define START_SEC_VAR_INIT_32BIT_6
#endif
#ifdef WDGIF_STOP_SEC_VAR_INIT_32BIT
	#undef WDGIF_STOP_SEC_VAR_INIT_32BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGIF_START_SEC_VAR_INIT_UNSPECIFIED
	#undef WDGIF_START_SEC_VAR_INIT_UNSPECIFIED
	#define START_SEC_VAR_INIT_UNSPECIFIED_6
#endif
#ifdef WDGIF_STOP_SEC_VAR_INIT_UNSPECIFIED
	#undef WDGIF_STOP_SEC_VAR_INIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef WDGIF_START_SEC_VAR_NOINIT_8BIT
	#undef WDGIF_START_SEC_VAR_NOINIT_8BIT
	#define START_SEC_VAR_NOINIT_8BIT_6
#endif
#ifdef WDGIF_STOP_SEC_VAR_NOINIT_8BIT
	#undef WDGIF_STOP_SEC_VAR_NOINIT_8BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGIF_START_SEC_VAR_NOINIT_16BIT
	#undef WDGIF_START_SEC_VAR_NOINIT_16BIT
	#define START_SEC_VAR_NOINIT_16BIT_6
#endif
#ifdef WDGIF_STOP_SEC_VAR_NOINIT_16BIT
	#undef WDGIF_STOP_SEC_VAR_NOINIT_16BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGIF_START_SEC_VAR_NOINIT_32BIT
	#undef WDGIF_START_SEC_VAR_NOINIT_32BIT
	#define START_SEC_VAR_NOINIT_32BIT_6
#endif
#ifdef WDGIF_STOP_SEC_VAR_NOINIT_32BIT
	#undef WDGIF_STOP_SEC_VAR_NOINIT_32BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGIF_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef WDGIF_START_SEC_VAR_NOINIT_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_6
#endif
#ifdef WDGIF_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef WDGIF_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef WDGIF_START_SEC_VAR_ZERO_INIT_8BIT
	#undef WDGIF_START_SEC_VAR_ZERO_INIT_8BIT
	#define START_SEC_VAR_ZERO_INIT_8BIT_6
#endif
#ifdef WDGIF_STOP_SEC_VAR_ZERO_INIT_8BIT
	#undef WDGIF_STOP_SEC_VAR_ZERO_INIT_8BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGIF_START_SEC_VAR_ZERO_INIT_16BIT
	#undef WDGIF_START_SEC_VAR_ZERO_INIT_16BIT
	#define START_SEC_VAR_ZERO_INIT_16BIT_6
#endif
#ifdef WDGIF_STOP_SEC_VAR_ZERO_INIT_16BIT
	#undef WDGIF_STOP_SEC_VAR_ZERO_INIT_16BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGIF_START_SEC_VAR_ZERO_INIT_32BIT
	#undef WDGIF_START_SEC_VAR_ZERO_INIT_32BIT
	#define START_SEC_VAR_ZERO_INIT_32BIT_6
#endif
#ifdef WDGIF_STOP_SEC_VAR_ZERO_INIT_32BIT
	#undef WDGIF_STOP_SEC_VAR_ZERO_INIT_32BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGIF_START_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#undef WDGIF_START_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef WDGIF_STOP_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#undef WDGIF_STOP_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef WDGIF_START_SEC_CONST_8BIT
	#undef WDGIF_START_SEC_CONST_8BIT
	#define START_SEC_CONST_8BIT
#endif
#ifdef WDGIF_STOP_SEC_CONST_8BIT
	#undef WDGIF_STOP_SEC_CONST_8BIT
	#define STOP_SEC_CONST
#endif

#ifdef WDGIF_START_SEC_CONST_16BIT
	#undef WDGIF_START_SEC_CONST_16BIT
	#define START_SEC_CONST_16BIT
#endif
#ifdef WDGIF_STOP_SEC_CONST_16BIT
	#undef WDGIF_STOP_SEC_CONST_16BIT
	#define STOP_SEC_CONST
#endif

#ifdef WDGIF_START_SEC_CONST_32BIT
	#undef WDGIF_START_SEC_CONST_32BIT
	#define START_SEC_CONST_32BIT
#endif
#ifdef WDGIF_STOP_SEC_CONST_32BIT
	#undef WDGIF_STOP_SEC_CONST_32BIT
	#define STOP_SEC_CONST
#endif

#ifdef WDGIF_START_SEC_CONST_UNSPECIFIED
	#undef WDGIF_START_SEC_CONST_UNSPECIFIED
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef WDGIF_STOP_SEC_CONST_UNSPECIFIED
	#undef WDGIF_STOP_SEC_CONST_UNSPECIFIED
	#define STOP_SEC_CONST
#endif

/**********************************************************************************************************************
*  WdgIf END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  NvM START
**********************************************************************************************************************/

#ifdef NVM_START_SEC_CODE
	#undef NVM_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef NVM_STOP_SEC_CODE
	#undef NVM_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef NVM_START_SEC_CONST_8BIT
	#undef NVM_START_SEC_CONST_8BIT
	#define START_SEC_CONST_8BIT
#endif
#ifdef NVM_STOP_SEC_CONST_8BIT
	#undef NVM_STOP_SEC_CONST_8BIT
	#define STOP_SEC_CONST
#endif

#ifdef NVM_START_SEC_CONST_16BIT
	#undef NVM_START_SEC_CONST_16BIT
	#define START_SEC_CONST_16BIT
#endif
#ifdef NVM_STOP_SEC_CONST_16BIT
	#undef NVM_STOP_SEC_CONST_16BIT
	#define STOP_SEC_CONST
#endif

#ifdef NVM_START_SEC_CONST_UNSPECIFIED
	#undef NVM_START_SEC_CONST_UNSPECIFIED
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef NVM_STOP_SEC_CONST_UNSPECIFIED
	#undef NVM_STOP_SEC_CONST_UNSPECIFIED
	#define STOP_SEC_CONST
#endif

#ifdef NVM_START_SEC_CONST_DESCRIPTOR_TABLE
	#undef NVM_START_SEC_CONST_DESCRIPTOR_TABLE
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef NVM_STOP_SEC_CONST_DESCRIPTOR_TABLE
	#undef NVM_STOP_SEC_CONST_DESCRIPTOR_TABLE
	#define STOP_SEC_CONST
#endif

#ifdef NVM_START_SEC_VAR_NOINIT_8BIT
	#undef NVM_START_SEC_VAR_NOINIT_8BIT
	#define START_SEC_VAR_NOINIT_8BIT_6
#endif
#ifdef NVM_STOP_SEC_VAR_NOINIT_8BIT
	#undef NVM_STOP_SEC_VAR_NOINIT_8BIT
	#define STOP_SEC_VAR
#endif

#ifdef NVM_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef NVM_START_SEC_VAR_NOINIT_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_6
#endif
#ifdef NVM_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef NVM_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef NVM_START_SEC_VAR_UNSPECIFIED
	#undef NVM_START_SEC_VAR_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_6
#endif
#ifdef NVM_STOP_SEC_VAR_UNSPECIFIED
	#undef NVM_STOP_SEC_VAR_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef NVM_START_SEC_VAR_FAST_8BIT
	#undef NVM_START_SEC_VAR_FAST_8BIT
	#define START_SEC_VAR_NOINIT_8BIT_6
#endif
#ifdef NVM_STOP_SEC_VAR_FAST_8BIT
	#undef NVM_STOP_SEC_VAR_FAST_8BIT
	#define STOP_SEC_VAR
#endif

#ifdef NVM_START_SEC_VAR_POWER_ON_INIT_UNSPECIFIED
	#undef NVM_START_SEC_VAR_POWER_ON_INIT_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
#endif
#ifdef NVM_STOP_SEC_VAR_POWER_ON_INIT_UNSPECIFIED
	#undef NVM_STOP_SEC_VAR_POWER_ON_INIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  NvM END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Crc START
**********************************************************************************************************************/

#ifdef CRC_START_SEC_CODE
	#undef CRC_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef CRC_STOP_SEC_CODE
	#undef CRC_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef CRC_START_SEC_CONST_8BIT
	#undef CRC_START_SEC_CONST_8BIT
	#define START_SEC_CONST_8BIT
#endif
#ifdef CRC_STOP_SEC_CONST_8BIT
	#undef CRC_STOP_SEC_CONST_8BIT
	#define STOP_SEC_CONST
#endif

#ifdef CRC_START_SEC_CONST_16BIT
	#undef CRC_START_SEC_CONST_16BIT
	#define START_SEC_CONST_16BIT
#endif
#ifdef CRC_STOP_SEC_CONST_16BIT
	#undef CRC_STOP_SEC_CONST_16BIT
	#define STOP_SEC_CONST
#endif

#ifdef CRC_START_SEC_CONST_32BIT
	#undef CRC_START_SEC_CONST_32BIT
	#define START_SEC_CONST_32BIT
#endif
#ifdef CRC_STOP_SEC_CONST_32BIT
	#undef CRC_STOP_SEC_CONST_32BIT
	#define STOP_SEC_CONST
#endif

/**********************************************************************************************************************
*  Crc END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  Det START
**********************************************************************************************************************/

#ifdef DET_START_SEC_CODE
	#undef DET_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef DET_STOP_SEC_CODE
	#undef DET_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef DET_START_SEC_VAR_UNSPECIFIED
	#undef DET_START_SEC_VAR_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_6
#endif
#ifdef DET_STOP_SEC_VAR_UNSPECIFIED
	#undef DET_STOP_SEC_VAR_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  Det START
**********************************************************************************************************************/

/**********************************************************************************************************************
*  EcuM START
**********************************************************************************************************************/

#ifdef ECUM_START_SEC_CODE
	#undef ECUM_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef ECUM_STOP_SEC_CODE
	#undef ECUM_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#ifdef ECUM_START_SEC_CODE_SET_BOOT_TARGET
	#undef ECUM_START_SEC_CODE_SET_BOOT_TARGET
	#define START_SEC_CODE
#endif
#ifdef ECUM_STOP_SEC_CODE_SET_BOOT_TARGET
	#undef ECUM_STOP_SEC_CODE_SET_BOOT_TARGET
	#define STOP_SEC_CODE
#endif

#ifdef ECUM_START_SEC_CODE_GET_BOOT_TARGET
	#undef ECUM_START_SEC_CODE_GET_BOOT_TARGET
	#define START_SEC_CODE
#endif
#ifdef ECUM_STOP_SEC_CODE_GET_BOOT_TARGET
	#undef ECUM_STOP_SEC_CODE_GET_BOOT_TARGET
	#define STOP_SEC_CODE
#endif

