sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef ECUM_START_SEC_CONST_8BIT
	#undef ECUM_START_SEC_CONST_8BIT
	#define START_SEC_CONST_8BIT
#endif
#ifdef ECUM_STOP_SEC_CONST_8BIT
	#undef ECUM_STOP_SEC_CONST_8BIT
	#define STOP_SEC_CONST
#endif

#ifdef ECUM_START_SEC_CONST_UNSPECIFIED
	#undef ECUM_START_SEC_CONST_UNSPECIFIED
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef ECUM_STOP_SEC_CONST_UNSPECIFIED
	#undef ECUM_STOP_SEC_CONST_UNSPECIFIED
	#define STOP_SEC_CONST
#endif

#ifdef ECUM_START_SEC_CONST_PBCFG_ROOT
	#undef ECUM_START_SEC_CONST_PBCFG_ROOT
	#define START_SEC_CONST_PBCFG
#endif
#ifdef ECUM_STOP_SEC_CONST_PBCFG_ROOT
	#undef ECUM_STOP_SEC_CONST_PBCFG_ROOT
	#define STOP_SEC_CONST
#endif

#ifdef ECUM_START_SEC_CONST_PBCFG
	#undef ECUM_START_SEC_CONST_PBCFG
	#define START_SEC_CONST_PBCFG
#endif
#ifdef ECUM_STOP_SEC_CONST_PBCFG
	#undef ECUM_STOP_SEC_CONST_PBCFG
	#define STOP_SEC_CONST
#endif

#ifdef ECUM_START_SEC_VAR_INIT_UNSPECIFIED
	#undef ECUM_START_SEC_VAR_INIT_UNSPECIFIED
	/* Intentional mapping to NOINIT section due to conflicting mapping in header */
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_6
#endif
#ifdef ECUM_STOP_SEC_VAR_INIT_UNSPECIFIED
	#undef ECUM_STOP_SEC_VAR_INIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef ECUM_START_SEC_VAR_NOINIT_8BIT
	#undef ECUM_START_SEC_VAR_NOINIT_8BIT
	#define START_SEC_VAR_NOINIT_8BIT_6
#endif
#ifdef ECUM_STOP_SEC_VAR_NOINIT_8BIT
	#undef ECUM_STOP_SEC_VAR_NOINIT_8BIT
	#define STOP_SEC_VAR
#endif

#ifdef ECUM_START_SEC_VAR_NOINIT_16BIT
	#undef ECUM_START_SEC_VAR_NOINIT_16BIT
	#define START_SEC_VAR_NOINIT_16BIT_6
#endif
#ifdef ECUM_STOP_SEC_VAR_NOINIT_16BIT
	#undef ECUM_STOP_SEC_VAR_NOINIT_16BIT
	#define STOP_SEC_VAR
#endif

#ifdef ECUM_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef ECUM_START_SEC_VAR_NOINIT_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_6
#endif
#ifdef ECUM_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef ECUM_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

/**********************************************************************************************************************
*  EcuM END
**********************************************************************************************************************/

/**********************************************************************************************************************
*  WdgM START
**********************************************************************************************************************/

#if defined WDGM_START_SEC_CODE
	#undef WDGM_START_SEC_CODE
	#define START_SEC_CODE
#endif
#ifdef WDGM_STOP_SEC_CODE
	#undef WDGM_STOP_SEC_CODE
	#define STOP_SEC_CODE
#endif

#if defined WDGM_START_SEC_VAR_INIT_8BIT
	#undef WDGM_START_SEC_VAR_INIT_8BIT
	#define START_SEC_VAR_INIT_8BIT_0
#endif
#ifdef WDGM_STOP_SEC_VAR_INIT_8BIT
	#undef WDGM_STOP_SEC_VAR_INIT_8BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGM_START_SEC_VAR_INIT_16BIT
	#undef WDGM_START_SEC_VAR_INIT_16BIT
	#define START_SEC_VAR_INIT_16BIT_0
#endif
#ifdef WDGM_STOP_SEC_VAR_INIT_16BIT
	#undef WDGM_STOP_SEC_VAR_INIT_16BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGM_START_SEC_VAR_INIT_32BIT
	#undef WDGM_START_SEC_VAR_INIT_32BIT
	#define START_SEC_VAR_INIT_32BIT_0
#endif
#ifdef WDGM_STOP_SEC_VAR_INIT_32BIT
	#undef WDGM_STOP_SEC_VAR_INIT_32BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGM_START_SEC_VAR_INIT_UNSPECIFIED
	#undef WDGM_START_SEC_VAR_INIT_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif

#ifdef WDGM_STOP_SEC_VAR_INIT_UNSPECIFIED
	#undef WDGM_STOP_SEC_VAR_INIT_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif

#ifdef WDGM_GLOBAL_START_SEC_VAR_INIT_32BIT
	#undef WDGM_GLOBAL_START_SEC_VAR_INIT_32BIT
	#undef MEMMAP_ERROR
#endif
#ifdef WDGM_GLOBAL_STOP_SEC_VAR_INIT_32BIT
	#undef WDGM_GLOBAL_STOP_SEC_VAR_INIT_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef WDGM_GLOBAL_SHARED_START_SEC_VAR_INIT_32BIT
	#undef WDGM_GLOBAL_SHARED_START_SEC_VAR_INIT_32BIT
	#undef MEMMAP_ERROR
#endif
#ifdef WDGM_GLOBAL_SHARED_STOP_SEC_VAR_INIT_32BIT
	#undef WDGM_GLOBAL_SHARED_STOP_SEC_VAR_INIT_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef WDGM_START_SEC_VAR_NOINIT_8BIT
	#undef WDGM_START_SEC_VAR_NOINIT_8BIT
	#define START_SEC_VAR_NOINIT_8BIT_0
#endif
#ifdef WDGM_STOP_SEC_VAR_NOINIT_8BIT
	#undef WDGM_STOP_SEC_VAR_NOINIT_8BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGM_START_SEC_VAR_NOINIT_16BIT
	#undef WDGM_START_SEC_VAR_NOINIT_16BIT
	#define START_SEC_VAR_NOINIT_16BIT_0
#endif
#ifdef WDGM_STOP_SEC_VAR_NOINIT_16BIT
	#undef WDGM_STOP_SEC_VAR_NOINIT_16BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGM_START_SEC_VAR_NOINIT_32BIT
	#undef WDGM_START_SEC_VAR_NOINIT_32BIT
	#define START_SEC_VAR_NOINIT_32BIT_0
#endif
#ifdef WDGM_STOP_SEC_VAR_NOINIT_32BIT
	#undef WDGM_STOP_SEC_VAR_NOINIT_32BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGM_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef WDGM_START_SEC_VAR_NOINIT_UNSPECIFIED
	#define START_SEC_VAR_NOINIT_UNSPECIFIED_0
#endif
#ifdef WDGM_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef WDGM_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef WDGM_GLOBAL_START_SEC_VAR_NOINIT_32BIT
	#undef WDGM_GLOBAL_START_SEC_VAR_NOINIT_32BIT
	#undef MEMMAP_ERROR
#endif
#ifdef WDGM_GLOBAL_STOP_SEC_VAR_NOINIT_32BIT
	#undef WDGM_GLOBAL_STOP_SEC_VAR_NOINIT_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef WDGM_GLOBAL_SHARED_START_SEC_VAR_NOINIT_32BIT
	#undef WDGM_GLOBAL_SHARED_START_SEC_VAR_NOINIT_32BIT
	#undef MEMMAP_ERROR
#endif
#ifdef WDGM_GLOBAL_SHARED_STOP_SEC_VAR_NOINIT_32BIT
	#undef WDGM_GLOBAL_SHARED_STOP_SEC_VAR_NOINIT_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef WDGM_GLOBAL_SHARED_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef WDGM_GLOBAL_SHARED_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif
#ifdef WDGM_GLOBAL_SHARED_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef WDGM_GLOBAL_SHARED_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif

#ifdef WDGM_START_SEC_VAR_ZERO_INIT_8BIT
	#undef WDGM_START_SEC_VAR_ZERO_INIT_8BIT
	#define START_SEC_VAR_ZERO_INIT_8BIT_0
#endif
#ifdef WDGM_STOP_SEC_VAR_ZERO_INIT_8BIT
	#undef WDGM_STOP_SEC_VAR_ZERO_INIT_8BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGM_START_SEC_VAR_ZERO_INIT_16BIT
	#undef WDGM_START_SEC_VAR_ZERO_INIT_16BIT
	#define START_SEC_VAR_ZERO_INIT_16BIT_0
#endif
#ifdef WDGM_STOP_SEC_VAR_ZERO_INIT_16BIT
	#undef WDGM_STOP_SEC_VAR_ZERO_INIT_16BIT
	#define STOP_SEC_VAR
#endif

#ifdef WDGM_START_SEC_VAR_ZERO_INIT_32BIT
	#undef WDGM_START_SEC_VAR_ZERO_INIT_32BIT
	#define START_SEC_VAR_ZERO_INIT_32BIT_0
#endif
#ifdef WDGM_STOP_SEC_VAR_ZERO_INIT_32BIT
	#undef WDGM_STOP_SEC_VAR_ZERO_INIT_32BIT
	#define STOP_SEC_VAR
#endif

