sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef WDGM_START_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#undef WDGM_START_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#define START_SEC_VAR_ZERO_INIT_UNSPECIFIED_0
#endif
#ifdef WDGM_STOP_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#undef WDGM_STOP_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#define STOP_SEC_VAR
#endif

#ifdef WDGM_GLOBAL_START_SEC_VAR_ZERO_INIT_32BIT
	#undef WDGM_GLOBAL_START_SEC_VAR_ZERO_INIT_32BIT
	#undef MEMMAP_ERROR
#endif
#ifdef WDGM_GLOBAL_STOP_SEC_VAR_ZERO_INIT_32BIT
	#undef WDGM_GLOBAL_STOP_SEC_VAR_ZERO_INIT_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef WDGM_GLOBAL_START_SEC_VAR_32BIT
	#undef WDGM_GLOBAL_START_SEC_VAR_32BIT
	#undef MEMMAP_ERROR
#endif
#ifdef WDGM_GLOBAL_STOP_SEC_VAR_32BIT
	#undef WDGM_GLOBAL_STOP_SEC_VAR_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef WDGM_GLOBAL_START_SEC_VAR_BOOLEAN
	#undef WDGM_GLOBAL_START_SEC_VAR_BOOLEAN
	#undef MEMMAP_ERROR
#endif
#ifdef WDGM_GLOBAL_STOP_SEC_VAR_BOOLEAN
	#undef WDGM_GLOBAL_STOP_SEC_VAR_BOOLEAN
	#undef MEMMAP_ERROR
#endif

#ifdef WDGM_GLOBAL_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef WDGM_GLOBAL_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif
#ifdef WDGM_GLOBAL_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef WDGM_GLOBAL_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif

#ifdef WDGM_GLOBAL_SHARED_START_SEC_VAR_ZERO_INIT_32BIT
	#undef WDGM_GLOBAL_SHARED_START_SEC_VAR_ZERO_INIT_32BIT
	#undef MEMMAP_ERROR
#endif
#ifdef WDGM_GLOBAL_SHARED_STOP_SEC_VAR_ZERO_INIT_32BIT
	#undef WDGM_GLOBAL_SHARED_STOP_SEC_VAR_ZERO_INIT_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef WDGM_SE0_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef WDGM_SE0_START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif
#ifdef WDGM_SE0_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef WDGM_SE0_STOP_SEC_VAR_NOINIT_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif

#ifdef WDGM_START_SEC_CONST_8BIT
	#undef WDGM_START_SEC_CONST_8BIT
	#define START_SEC_CONST_8BIT
#endif
#ifdef WDGM_STOP_SEC_CONST_8BIT
	#undef WDGM_STOP_SEC_CONST_8BIT
	#define STOP_SEC_CONST
#endif

#ifdef WDGM_START_SEC_CONST_16BIT
	#undef WDGM_START_SEC_CONST_16BIT
	#define START_SEC_CONST_16BIT
#endif
#ifdef WDGM_STOP_SEC_CONST_16BIT
	#undef WDGM_STOP_SEC_CONST_16BIT
	#define STOP_SEC_CONST
#endif

#ifdef WDGM_START_SEC_CONST_32BIT
	#undef WDGM_START_SEC_CONST_32BIT
	#define START_SEC_CONST_32BIT
#endif
#ifdef WDGM_STOP_SEC_CONST_32BIT
	#undef WDGM_STOP_SEC_CONST_32BIT
	#define STOP_SEC_CONST
#endif

#ifdef WDGM_START_SEC_CONST_UNSPECIFIED
	#undef WDGM_START_SEC_CONST_UNSPECIFIED
	#define START_SEC_CONST_UNSPECIFIED
#endif
#ifdef WDGM_STOP_SEC_CONST_UNSPECIFIED
	#undef WDGM_STOP_SEC_CONST_UNSPECIFIED
	#define STOP_SEC_CONST
#endif

/**********************************************************************************************************************
*  WdgM END
**********************************************************************************************************************/



/*------------------------------GLOBAL-SECTIONS-----------------------------*/
/* Check code sections */
#if ( (defined CODE_SEC_OPEN)                            && \
	 ((defined START_SEC_CODE                          ) || \
	  (defined START_SEC_CODE_FAST                     ) || \
	  (defined START_SEC_CODE_ISR                      )    \
	  ))
	#error "MemMap.h: Close the former code segment before opening a new one."
#endif

/* Check const sections */
#if ( (defined CONST_SEC_OPEN)                           && \
	 ((defined START_SEC_CONST_8BIT                    ) || \
	  (defined START_SEC_CONST_16BIT                   ) || \
	  (defined START_SEC_CONST_32BIT                   ) || \
	  (defined START_SEC_CONST_UNSPECIFIED             ) || \
	  (defined START_SEC_CONST_FAST_8BIT               ) || \
	  (defined START_SEC_CONST_FAST_16BIT              ) || \
	  (defined START_SEC_CONST_FAST_32BIT              ) || \
	  (defined START_SEC_CONST_FAST_UNSPECIFIED        ) || \
	  (defined START_SEC_CONST_PBCFG                   )    \
	  ))
	#error "MemMap.h: Close the former const segment before opening a new one."
#endif

/* Check data sections */
#if ( (defined VAR_SEC_OPEN)	&& \
	  ( (defined START_SEC_VAR_INIT_8BIT							) || \
		(defined START_SEC_VAR_INIT_16BIT							) || \
		(defined START_SEC_VAR_INIT_32BIT							) || \
		(defined START_SEC_VAR_INIT_UNSPECIFIED						) || \
		(defined START_SEC_VAR_NOINIT_8BIT							) || \
		(defined START_SEC_VAR_NOINIT_16BIT							) || \
		(defined START_SEC_VAR_NOINIT_32BIT							) || \
		(defined START_SEC_VAR_NOINIT_UNSPECIFIED					) || \
		(defined START_SEC_VAR_ZERO_INIT_8BIT						) || \
		(defined START_SEC_VAR_ZERO_INIT_16BIT						) || \
		(defined START_SEC_VAR_ZERO_INIT_32BIT						) || \
		(defined START_SEC_VAR_ZERO_INIT_UNSPECIFIED				) || \
		(defined START_SEC_VAR_FAST_INIT_8BIT						) || \
		(defined START_SEC_VAR_FAST_INIT_16BIT						) || \
		(defined START_SEC_VAR_FAST_INIT_32BIT						) || \
		(defined START_SEC_VAR_FAST_INIT_UNSPECIFIED				) || \
		(defined START_SEC_VAR_FAST_NOINIT_8BIT						) || \
		(defined START_SEC_VAR_FAST_NOINIT_16BIT					) || \
		(defined START_SEC_VAR_FAST_NOINIT_32BIT					) || \
		(defined START_SEC_VAR_FAST_NOINIT_UNSPECIFIED				) || \
		(defined START_SEC_VAR_FAST_ZERO_INIT_8BIT					) || \
		(defined START_SEC_VAR_FAST_ZERO_INIT_16BIT					) || \
		(defined START_SEC_VAR_FAST_ZERO_INIT_32BIT					) || \
		(defined START_SEC_VAR_FAST_ZERO_INIT_UNSPECIFIED			) || \
		(defined START_SEC_VAR_POWER_ON_CLEARED_UNSPECIFIED			) || \
		(defined START_SEC_VAR_INIT_8BIT_0							) || \
		(defined START_SEC_VAR_INIT_16BIT_0							) || \
		(defined START_SEC_VAR_INIT_32BIT_0							) || \
		(defined START_SEC_VAR_INIT_UNSPECIFIED_0					) || \
		(defined START_SEC_VAR_NOINIT_8BIT_0						) || \
		(defined START_SEC_VAR_NOINIT_16BIT_0						) || \
		(defined START_SEC_VAR_NOINIT_32BIT_0						) || \
		(defined START_SEC_VAR_NOINIT_UNSPECIFIED_0					) || \
		(defined START_SEC_VAR_ZERO_INIT_8BIT_0						) || \
		(defined START_SEC_VAR_ZERO_INIT_16BIT_0					) || \
		(defined START_SEC_VAR_ZERO_INIT_32BIT_0					) || \
		(defined START_SEC_VAR_ZERO_INIT_UNSPECIFIED_0				) || \
		(defined START_SEC_VAR_INIT_8BIT_6							) || \
		(defined START_SEC_VAR_INIT_16BIT_6							) || \
		(defined START_SEC_VAR_INIT_32BIT_6							) || \
		(defined START_SEC_VAR_INIT_UNSPECIFIED_6					) || \
		(defined START_SEC_VAR_NOINIT_8BIT_6						) || \
		(defined START_SEC_VAR_NOINIT_16BIT_6						) || \
		(defined START_SEC_VAR_NOINIT_32BIT_6						) || \
		(defined START_SEC_VAR_NOINIT_UNSPECIFIED_6					) || \
		(defined START_SEC_VAR_ZERO_INIT_8BIT_6						) || \
		(defined START_SEC_VAR_ZERO_INIT_16BIT_6					) || \
		(defined START_SEC_VAR_ZERO_INIT_32BIT_6					) || \
		(defined START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6				) || \
		(defined START_SEC_VAR_INIT_8BIT_9							) || \
		(defined START_SEC_VAR_INIT_16BIT_9							) || \
		(defined START_SEC_VAR_INIT_32BIT_9							) || \
		(defined START_SEC_VAR_INIT_UNSPECIFIED_9					) || \
		(defined START_SEC_VAR_NOINIT_8BIT_9						) || \
		(defined START_SEC_VAR_NOINIT_16BIT_9						) || \
		(defined START_SEC_VAR_NOINIT_32BIT_9						) || \
		(defined START_SEC_VAR_NOINIT_UNSPECIFIED_9					) || \
		(defined START_SEC_VAR_ZERO_INIT_8BIT_9						) || \
		(defined START_SEC_VAR_ZERO_INIT_16BIT_9					) || \
		(defined START_SEC_VAR_ZERO_INIT_32BIT_9					) || \
		(defined START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9				) || \
		(defined START_SEC_VAR_INIT_8BIT_10							) || \
		(defined START_SEC_VAR_INIT_16BIT_10						) || \
		(defined START_SEC_VAR_INIT_32BIT_10						) || \
		(defined START_SEC_VAR_INIT_UNSPECIFIED_10					) || \
		(defined START_SEC_VAR_NOINIT_8BIT_10						) || \
		(defined START_SEC_VAR_NOINIT_16BIT_10						) || \
		(defined START_SEC_VAR_NOINIT_32BIT_10						) || \
		(defined START_SEC_VAR_NOINIT_UNSPECIFIED_10				) || \
		(defined START_SEC_VAR_ZERO_INIT_8BIT_10					) || \
		(defined START_SEC_VAR_ZERO_INIT_16BIT_10					) || \
		(defined START_SEC_VAR_ZERO_INIT_32BIT_10					) || \
		(defined START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10				) || \
		(defined START_SEC_VAR_INIT_8BIT_11							) || \
		(defined START_SEC_VAR_INIT_16BIT_11						) || \
		(defined START_SEC_VAR_INIT_32BIT_11						) || \
		(defined START_SEC_VAR_INIT_UNSPECIFIED_11					) || \
		(defined START_SEC_VAR_NOINIT_8BIT_11						) || \
		(defined START_SEC_VAR_NOINIT_16BIT_11						) || \
		(defined START_SEC_VAR_NOINIT_32BIT_11						) || \
		(defined START_SEC_VAR_NOINIT_UNSPECIFIED_11				) || \
		(defined START_SEC_VAR_ZERO_INIT_8BIT_11					) || \
		(defined START_SEC_VAR_ZERO_INIT_16BIT_11					) || \
		(defined START_SEC_VAR_ZERO_INIT_32BIT_11					) || \
		(defined START_SEC_VAR_ZERO_INIT_UNSPECIFIED_11				) || \
		(defined START_SEC_VAR_INIT_8BIT_GLOBALSHARED				) || \
		(defined START_SEC_VAR_INIT_16BIT_GLOBALSHARED				) || \
		(defined START_SEC_VAR_INIT_32BIT_GLOBALSHARED				) || \
		(defined START_SEC_VAR_INIT_UNSPECIFIED_GLOBALSHARED		) || \
		(defined START_SEC_VAR_NOINIT_8BIT_GLOBALSHARED				) || \
		(defined START_SEC_VAR_NOINIT_16BIT_GLOBALSHARED			) || \
		(defined START_SEC_VAR_NOINIT_32BIT_GLOBALSHARED			) || \
		(defined START_SEC_VAR_NOINIT_UNSPECIFIED_GLOBALSHARED		) || \
		(defined START_SEC_VAR_ZERO_INIT_8BIT_GLOBALSHARED			) || \
		(defined START_SEC_VAR_ZERO_INIT_16BIT_GLOBALSHARED			) || \
		(defined START_SEC_VAR_ZERO_INIT_32BIT_GLOBALSHARED			) || \
		(defined START_SEC_VAR_ZERO_INIT_UNSPECIFIED_GLOBALSHARED	) ) )
	#error "MemMap.h: Close the former variable segment before opening a new one."
#endif



/*------------------------------GLOBAL-START-SECTIONS------------------------------*/

