sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
/* Code section */
#ifdef START_SEC_CODE
	#define CODE_SEC_OPEN
/* Enter here a #pragma command for opening the specified section */
/*    #pragma */
	#undef START_SEC_CODE
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_CODE_FAST
	#define CODE_SEC_OPEN
/* Enter here a #pragma command for opening the specified section */
/*    #pragma */
	#undef START_SEC_CODE_FAST
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_CODE_ISR
	#define CODE_SEC_OPEN
/* Enter here a #pragma command for opening the specified section */
/*    #pragma */
	#undef START_SEC_CODE_ISR
	#undef MEMMAP_ERROR
#endif




/* Const section */
#ifdef START_SEC_CONST_8BIT
	#define CONST_SEC_OPEN
/* Enter here a #pragma command for opening the specified section */
/*    #pragma */
	#undef START_SEC_CONST_8BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_CONST_16BIT
	#define CONST_SEC_OPEN
/* Enter here a #pragma command for opening the specified section */
/*    #pragma */
	#undef START_SEC_CONST_16BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_CONST_32BIT
	#define CONST_SEC_OPEN
/* Enter here a #pragma command for opening the specified section */
/*    #pragma */
	#undef START_SEC_CONST_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_CONST_UNSPECIFIED
	#define CONST_SEC_OPEN
/* Enter here a #pragma command for opening the specified section */
/*    #pragma */
	#undef START_SEC_CONST_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_CONST_FAST_8BIT
	#define CONST_SEC_OPEN
/* Enter here a #pragma command for opening the specified section */
/*    #pragma */
	#undef START_SEC_CONST_FAST_8BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_CONST_FAST_16BIT
	#define CONST_SEC_OPEN
/* Enter here a #pragma command for opening the specified section */
/*    #pragma */
	#undef START_SEC_CONST_FAST_16BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_CONST_FAST_32BIT
	#define CONST_SEC_OPEN
/* Enter here a #pragma command for opening the specified section */
/*    #pragma */
	#undef START_SEC_CONST_FAST_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_CONST_FAST_UNSPECIFIED
	#define CONST_SEC_OPEN
/* Enter here a #pragma command for opening the specified section */
/*    #pragma */
	#undef START_SEC_CONST_FAST_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_CONST_PBCFG
	#define CONST_SEC_OPEN
/* Enter here a #pragma command for opening the specified section */
/*    #pragma */
	#undef START_SEC_CONST_PBCFG
	#undef MEMMAP_ERROR
#endif




/* Var section */
#ifdef START_SEC_VAR_INIT_8BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_INIT_8BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_16BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_INIT_16BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_32BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_INIT_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_UNSPECIFIED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_INIT_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_NOINIT_8BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:noinit")
	#undef START_SEC_VAR_NOINIT_8BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_16BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:noinit")
	#undef START_SEC_VAR_NOINIT_16BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_32BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:noinit")
	#undef START_SEC_VAR_NOINIT_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_UNSPECIFIED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:noinit")
	#undef START_SEC_VAR_NOINIT_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_ZERO_INIT_8BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_ZERO_INIT_8BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_16BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_ZERO_INIT_16BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_32BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_ZERO_INIT_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_ZERO_INIT_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_FAST_INIT_8BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_FAST_INIT_8BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_FAST_INIT_16BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_FAST_INIT_16BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_FAST_INIT_32BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_FAST_INIT_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_FAST_INIT_UNSPECIFIED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_FAST_INIT_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_FAST_NOINIT_8BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:noinit")
	#undef START_SEC_VAR_FAST_NOINIT_8BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_FAST_NOINIT_16BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:noinit")
	#undef START_SEC_VAR_FAST_NOINIT_16BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_FAST_NOINIT_32BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:noinit")
	#undef START_SEC_VAR_FAST_NOINIT_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_FAST_NOINIT_UNSPECIFIED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:noinit")
	#undef START_SEC_VAR_FAST_NOINIT_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_FAST_ZERO_INIT_8BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_FAST_ZERO_INIT_8BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_FAST_ZERO_INIT_16BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_FAST_ZERO_INIT_16BIT
	#undef MEMMAP_ERROR
#endif

