sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef START_SEC_VAR_FAST_ZERO_INIT_32BIT
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_FAST_ZERO_INIT_32BIT
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_FAST_ZERO_INIT_UNSPECIFIED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_FAST_ZERO_INIT_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_POWER_ON_CLEARED_UNSPECIFIED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".noclear")
	#undef START_SEC_VAR_POWER_ON_CLEARED_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif



/**************** Application 0 ****************/

#ifdef START_SEC_VAR_INIT_8BIT_0
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_INIT_8BIT_0
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_16BIT_0
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_INIT_16BIT_0
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_32BIT_0
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_INIT_32BIT_0
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_UNSPECIFIED_0
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_INIT_UNSPECIFIED_0
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_NOINIT_8BIT_0
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:noinit")
	#undef START_SEC_VAR_NOINIT_8BIT_0
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_16BIT_0
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:noinit")
	#undef START_SEC_VAR_NOINIT_16BIT_0
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_32BIT_0
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:noinit")
	#undef START_SEC_VAR_NOINIT_32BIT_0
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_UNSPECIFIED_0
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:noinit")
	#undef START_SEC_VAR_NOINIT_UNSPECIFIED_0
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_ZERO_INIT_8BIT_0
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_ZERO_INIT_8BIT_0
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_16BIT_0
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_ZERO_INIT_16BIT_0
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_32BIT_0
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_ZERO_INIT_32BIT_0
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_UNSPECIFIED_0
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_0:init")
	#undef START_SEC_VAR_ZERO_INIT_UNSPECIFIED_0
	#undef MEMMAP_ERROR
#endif



/**************** Application 6 ****************/

#ifdef START_SEC_VAR_INIT_8BIT_6
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_6:init")
	#undef START_SEC_VAR_INIT_8BIT_6
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_16BIT_6
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_6:init")
	#undef START_SEC_VAR_INIT_16BIT_6
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_32BIT_6
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_6:init")
	#undef START_SEC_VAR_INIT_32BIT_6
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_UNSPECIFIED_6
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_6:init")
	#undef START_SEC_VAR_INIT_UNSPECIFIED_6
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_NOINIT_8BIT_6
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_6:noinit")
	#undef START_SEC_VAR_NOINIT_8BIT_6
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_16BIT_6
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_6:noinit")
	#undef START_SEC_VAR_NOINIT_16BIT_6
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_32BIT_6
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_6:noinit")
	#undef START_SEC_VAR_NOINIT_32BIT_6
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_UNSPECIFIED_6
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_6:noinit")
	#undef START_SEC_VAR_NOINIT_UNSPECIFIED_6
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_ZERO_INIT_8BIT_6
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_6:init")
	#undef START_SEC_VAR_ZERO_INIT_8BIT_6
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_16BIT_6
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_6:init")
	#undef START_SEC_VAR_ZERO_INIT_16BIT_6
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_32BIT_6
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_6:init")
	#undef START_SEC_VAR_ZERO_INIT_32BIT_6
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_6:init")
	#undef START_SEC_VAR_ZERO_INIT_UNSPECIFIED_6
	#undef MEMMAP_ERROR
#endif



/**************** Application 9 ****************/

#ifdef START_SEC_VAR_INIT_8BIT_9
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_9:init")
	#undef START_SEC_VAR_INIT_8BIT_9
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_16BIT_9
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_9:init")
	#undef START_SEC_VAR_INIT_16BIT_9
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_32BIT_9
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_9:init")
	#undef START_SEC_VAR_INIT_32BIT_9
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_UNSPECIFIED_9
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_9:init")
	#undef START_SEC_VAR_INIT_UNSPECIFIED_9
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_NOINIT_8BIT_9
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_9:noinit")
	#undef START_SEC_VAR_NOINIT_8BIT_9
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_16BIT_9
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_9:noinit")
	#undef START_SEC_VAR_NOINIT_16BIT_9
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_32BIT_9
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_9:noinit")
	#undef START_SEC_VAR_NOINIT_32BIT_9
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_UNSPECIFIED_9
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_9:noinit")
	#undef START_SEC_VAR_NOINIT_UNSPECIFIED_9
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_ZERO_INIT_8BIT_9
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_9:init")
	#undef START_SEC_VAR_ZERO_INIT_8BIT_9
	#undef MEMMAP_ERROR
#endif

