sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef START_SEC_VAR_ZERO_INIT_16BIT_9
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_9:init")
	#undef START_SEC_VAR_ZERO_INIT_16BIT_9
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_32BIT_9
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_9:init")
	#undef START_SEC_VAR_ZERO_INIT_32BIT_9
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_9:init")
	#undef START_SEC_VAR_ZERO_INIT_UNSPECIFIED_9
	#undef MEMMAP_ERROR
#endif



/**************** Application 10 ****************/

#ifdef START_SEC_VAR_INIT_8BIT_10
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_10:init")
	#undef START_SEC_VAR_INIT_8BIT_10
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_16BIT_10
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_10:init")
	#undef START_SEC_VAR_INIT_16BIT_10
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_32BIT_10
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_10:init")
	#undef START_SEC_VAR_INIT_32BIT_10
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_UNSPECIFIED_10
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_10:init")
	#undef START_SEC_VAR_INIT_UNSPECIFIED_10
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_NOINIT_8BIT_10
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_10:noinit")
	#undef START_SEC_VAR_NOINIT_8BIT_10
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_16BIT_10
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_10:noinit")
	#undef START_SEC_VAR_NOINIT_16BIT_10
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_32BIT_10
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_10:noinit")
	#undef START_SEC_VAR_NOINIT_32BIT_10
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_UNSPECIFIED_10
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_10:noinit")
	#undef START_SEC_VAR_NOINIT_UNSPECIFIED_10
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_ZERO_INIT_8BIT_10
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_10:init")
	#undef START_SEC_VAR_ZERO_INIT_8BIT_10
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_16BIT_10
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_10:init")
	#undef START_SEC_VAR_ZERO_INIT_16BIT_10
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_32BIT_10
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_10:init")
	#undef START_SEC_VAR_ZERO_INIT_32BIT_10
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_10:init")
	#undef START_SEC_VAR_ZERO_INIT_UNSPECIFIED_10
	#undef MEMMAP_ERROR
#endif



/**************** Application 11 ****************/

#ifdef START_SEC_VAR_INIT_8BIT_11
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_11:init")
	#undef START_SEC_VAR_INIT_8BIT_11
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_16BIT_11
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_11:init")
	#undef START_SEC_VAR_INIT_16BIT_11
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_32BIT_11
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_11:init")
	#undef START_SEC_VAR_INIT_32BIT_11
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_UNSPECIFIED_11
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_11:init")
	#undef START_SEC_VAR_INIT_UNSPECIFIED_11
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_NOINIT_8BIT_11
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_11:noinit")
	#undef START_SEC_VAR_NOINIT_8BIT_11
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_16BIT_11
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_11:noinit")
	#undef START_SEC_VAR_NOINIT_16BIT_11
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_32BIT_11
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_11:noinit")
	#undef START_SEC_VAR_NOINIT_32BIT_11
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_UNSPECIFIED_11
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_11:noinit")
	#undef START_SEC_VAR_NOINIT_UNSPECIFIED_11
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_ZERO_INIT_8BIT_11
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_11:init")
	#undef START_SEC_VAR_ZERO_INIT_8BIT_11
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_16BIT_11
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_11:init")
	#undef START_SEC_VAR_ZERO_INIT_16BIT_11
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_32BIT_11
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_11:init")
	#undef START_SEC_VAR_ZERO_INIT_32BIT_11
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_UNSPECIFIED_11
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossDataAp_11:init")
	#undef START_SEC_VAR_ZERO_INIT_UNSPECIFIED_11
	#undef MEMMAP_ERROR
#endif



/**************** Global Shared ****************/

#ifdef START_SEC_VAR_INIT_8BIT_GLOBALSHARED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossGlobalShared")
	#undef START_SEC_VAR_INIT_8BIT_GLOBALSHARED
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_16BIT_GLOBALSHARED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossGlobalShared")
	#undef START_SEC_VAR_INIT_16BIT_GLOBALSHARED
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_32BIT_GLOBALSHARED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossGlobalShared")
	#undef START_SEC_VAR_INIT_32BIT_GLOBALSHARED
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_INIT_UNSPECIFIED_GLOBALSHARED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossGlobalShared")
	#undef START_SEC_VAR_INIT_UNSPECIFIED_GLOBALSHARED
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_NOINIT_8BIT_GLOBALSHARED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossGlobalShared")
	#undef START_SEC_VAR_NOINIT_8BIT_GLOBALSHARED
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_16BIT_GLOBALSHARED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossGlobalShared")
	#undef START_SEC_VAR_NOINIT_16BIT_GLOBALSHARED
	#undef MEMMAP_ERROR
#endif

