sweet-dreams-only/EmbeddedSystem_EA3_PSA_CMP/PSA_CMP_EPS_TMS570/SwProject/Header/MemMap.h
#ifdef START_SEC_VAR_NOINIT_32BIT_GLOBALSHARED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossGlobalShared")
	#undef START_SEC_VAR_NOINIT_32BIT_GLOBALSHARED
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_NOINIT_UNSPECIFIED_GLOBALSHARED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossGlobalShared")
	#undef START_SEC_VAR_NOINIT_UNSPECIFIED_GLOBALSHARED
	#undef MEMMAP_ERROR
#endif


#ifdef START_SEC_VAR_ZERO_INIT_8BIT_GLOBALSHARED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossGlobalShared")
	#undef START_SEC_VAR_ZERO_INIT_8BIT_GLOBALSHARED
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_16BIT_GLOBALSHARED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossGlobalShared")
	#undef START_SEC_VAR_ZERO_INIT_16BIT_GLOBALSHARED
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_32BIT_GLOBALSHARED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossGlobalShared")
	#undef START_SEC_VAR_ZERO_INIT_32BIT_GLOBALSHARED
	#undef MEMMAP_ERROR
#endif

#ifdef START_SEC_VAR_ZERO_INIT_UNSPECIFIED_GLOBALSHARED
	#define VAR_SEC_OPEN
	#pragma SET_DATA_SECTION(".ossGlobalShared")
	#undef START_SEC_VAR_ZERO_INIT_UNSPECIFIED_GLOBALSHARED
	#undef MEMMAP_ERROR
#endif



/*------------------------------GENERAL-STOP-SECTIONS-------------------------------*/

/*default segment for Code*/
#ifdef STOP_SEC_CODE
	#undef CODE_SEC_OPEN
	#pragma SET_CODE_SECTION()
	#undef STOP_SEC_CODE
	#undef MEMMAP_ERROR
#endif

/*default segment for Constants*/
#ifdef STOP_SEC_CONST_UNSPECIFIED
	#undef CONST_SEC_OPEN
	#pragma SET_DATA_SECTION()
	#undef STOP_SEC_CONST_UNSPECIFIED
	#undef MEMMAP_ERROR
#endif

/*default segment for Constants*/
#ifdef STOP_SEC_CONST
	#undef CONST_SEC_OPEN
	#pragma SET_DATA_SECTION()
	#undef STOP_SEC_CONST
	#undef MEMMAP_ERROR
#endif

/*default segment for Datas*/
#ifdef STOP_SEC_VAR
	#undef VAR_SEC_OPEN
	#pragma SET_DATA_SECTION()
	#undef STOP_SEC_VAR
	#undef MEMMAP_ERROR
#endif


#ifdef MEMMAP_ERROR
	#error "MemMap.h, wrong pragma command"
#endif




#endif /* DEFEAT_MEMMAP */


/**********************************************************************************************************************
*  END
**********************************************************************************************************************/
